Repository: orbisgis/orbisgis
Catalog: bundles/geocatalog-tree/src/main/resources/org/orbisgis/geocatalogtree/translation/language/*.po
Languages: fr

source: Save the source in a file.
fr: Sauver la source dans un fichier.

source: Cannot create the file
fr: Impossible de créer le fichier

source: GeoCatalog
fr: GeoCatalogue

source: Add filter
fr: Ajouter un filtre

source: Add a new data source filter
fr: Ajouter un nouveau filtre

source: Add
fr: Ajouter

source: File
fr: Fichier

source: Add a file from hard drive.
fr: Ajouter un ficher à partir d'un disque dur.

source: Folder
fr: Dossier

source: Add a set of file from an hard drive folder.
fr: Ajouter une série de fichier à partir d'un dossier.

source: Save
fr: Sauver

source: Save selected sources in files
fr: Sauver les sources sélectionnées dans des fichiers

source: Remove the source
fr: Supprimer la source

source: Remove from this list the selected sources.
fr: Supprimer de cette liste les sources sélectionnées.

source: Cannot remove the source {0}
fr: Impossible de supprimer la source {0}

source: Connection parameters
fr: Paramètres de connexion

source: Connexion name
fr: Nom de la connexion

source: MyConnexion
fr: MaConnexion

source: Type of database
fr: Type de base de données

source: Host
fr: Hôte

source: Default port
fr: Port par défaut

source: Database name
fr: Nom de la base de données

source: Please specify a connexion name
fr: Veuillez spécifier un nom de connexion

source: The database name is mandatory
fr: Le nom de la base de données est obligatoire

source: The host cannot be null
fr: L'hôte ne peut être null

source: The port field is mandatory
fr: Le numéro de port est obligatoire

source: The port number must lie between 0 and 32767.
fr: Le numéro de port doit être compris entre 0 et 32767.

source: Cannot format the port code into an int
fr: Impossible de formater le code du port dans un int

source: The port number must be comprise between 0 and 32767
fr: Le numéro de port doit être compris entre 0 et 32767

source: Connect to the database
fr: Connecter à la base de données

source: Disconnect
fr: Déconnecter

source: Add a new connection
fr: Ajouter une nouvelle connexion

source: Edit the connection
fr: Éditer la connexion

source: Remove the connection
fr: Supprimer la connexion

source: Saved with the OrbisGIS database panel
fr: Sauver via l'interface de base de données

source: There is already a connection with this name.
fr: Il y a déjà une connexion avec ce nom

source: Contains
fr: Contient

source: Alphanumeric
fr: Alphanumérique

source: DataBase
fr: Base de données

source: Files
fr: Fichier

source: Geometry
fr: Géométrie

source: Vectorial
fr: Vecteur

source: System Table
fr: Table système

source: Source type is
fr: Le type de source est

source: Not contains
fr: Ne contient pas
