Repository: orbisgis/orbisgis
Catalog: orbisgis-core/src/main/resources/org/orbisgis/core/translation/language/*.po
Languages: fr

source: Headless graphics environment, set current DPI to 96.0
fr: Environnement sans sortie graphique, DPI mis à 96.0

source: The parameter of the logarithmic function must be greater than 0
fr: Le paramètre de la fonction logarithme doit être supérieur à 0

source: Cannot draw the shape
fr: Impossible de dessiner l'enveloppe

source: Layer {0} not drawn
fr: Couche {0} non dessinée

source: Cannot get Stream image
fr: Impossible d'obtenir le flux d'image

source: Perpendicular offset failed
fr: Échec du décalage perpendiculaire

source: PERCENT
fr: POURCENT

source: CLOSE
fr: FERMER

source: CUBIC TO {0}:{1}
fr: CUBIQUE VERS {0}:{1}

source: LINE TO {0}:{1}
fr: LIGNE VERS {0}:{1}

source: MOVE TO {0}:{1}
fr: DÉPLACER VERS {0}:{1}

source: !DEFAULT!
fr: !DÉFAUT!

source: Unable to compute perpendicular offset
fr: Impossible de calculer le décalage perpendiculaire

source: Error during graphic composition
fr: Erreur pendant la composition du graphique

source: Could not render graphic
fr: Impossible de dessiner le graphique

source: SQUARE
fr: CARREE

source: HALFCIRCLE
fr: DEMI-CERCLE

source: STAR
fr: ETOILE

source: CROSS
fr: CROIX

source: CIRCLE
fr: CERCLE

source: Could not find position for mark within area
fr: Impossible de trouver une position pour l'objet au sein de la surface

source: Area Symbolizer
fr: Symbole surfacique

source: Point Symbolizer
fr: Symbole ponctuel

source: Dash array must be made of positive numbers separated with spaces.
fr: Le vecteur de pointillés doit être composé de nombres positifs séparés par des espaces

source: Fallback ({0})
fr: Valeur par défaut ({0})

source: Manual
fr: Manuel

source: Natural breaks
fr: Ruptures naturelles

source: Equal Intervals
fr: Intervalles égaux

source: Mean - Standard deviation
fr: Moyenne - écart type

source: Boxed means
fr: Moyennes emboîtées

source: Unable to categorize the feature
fr: Impossible de classifier la donnée

source: Fallback
fr: Valeur par défaut

source: Line Symbolizer
fr: Symbole linéaire

source: Cannot close the data source
fr: Impossible de fermer la source de données

source: Cannot check source contents
fr: Impossible de vérifier les contenus de la source

source: The source contains no spatial info
fr: La source ne contient pas d'informations spatiales

source: Cannot open layer : {0}
fr: Impossible d''ouvrir la couche : {0}

source: Cannot remove the layer {0}
fr: Impossible de supprimer la couche {0}

source: Cannot close layer {0}
fr: Impossible de fermer la couche {0}

source: Layer provided for drawing is not from the map context layer model.
fr: La couche fournie pour le dessin ne provient pas du modèle de carte.

source: The map is not open
fr: La carte n'est pas ouverte

source: Unable to serialise the data source of layer {0}
fr: Impossible d''enregistrer la source de données de la couche {0}

source: Unable to read the provided map context
fr: Impossible de lire le contexte cartographique fourni

source: Error raised while exporting the map context
fr: Une erreur est survenue lors de l'export du contexte cartographique

source: The map must be closed to invoke this method
fr: La carte doit être fermée pour pouvoir invoquer cette méthode

source: Error while trying to find an absolute path for an external resource
fr: Erreur lors de la tentative pour trouver un chemin absolu pour une ressource externe

source: Unable to load the data source uri {0}.
fr: Impossible de charger la source de données avec l''URI {0}.

source: Unable to parse the href URI {0}.
fr: Impossible d'analyser l'URI {0}.

source: Unable to load the description of the layer {0}
fr: Impossible de charger la description de la couche {0}.

source: The layer has not been imported
fr: La couche n'a pas été importée

source: The map is already open
fr: La carte est déjà ouverte

source: Cannot associate layer {0}, this layer must be removed manually
fr: Impossible d''associer la couche {0}, cette couche doit être supprimée manuellement

source: Cannot move a layer to its child
fr: Impossible de déplacer la couche dans un de ses enfants

source: This layer cannot have children
fr: Cette couche ne peut pas avoir d'enfants

source: This layer does not have children
fr: Cette couche n'a pas d'enfants

source: This layer doesn't contain any child
fr: Cette couche ne contient pas d'enfant

source: Cannot get the extent of the layer {0}
fr: Impossible de récupérer l''étendue de la couche {0}

source: The layer cannot listen to source modifications
fr: La couche ne peut pas surveiller les modifications de la source

source: Cannot open the layer
fr: impossible d'ouvrir la couche

source: The field is not {0}
fr: Le champ n''est pas {0}

source: The field {0} is not found
fr: Le champ {0} n'a pas été trouvé

source: This layer is not a raster
fr: Cette couche n'est pas un raster

source: HTTP Error {0} message : {1}
fr: Erreur HTTP {0} message : {1}

source: Invalid XML content
fr: Contenu XML invalide

source: HTTP Error {0} message : {1} with the URL {2}
fr: Erreur HTTP {0} message : {1} avec l''URL {2}

source: Cannot parse the provided date {0}
fr: impossible d''analyser la donnée fournie {0}

source: HTTP Error {0} message : {1} while removing the map context from {2}
fr: Erreur HTTP {0} message : {1} pendant la suppression du contexte cartographique de {2}

source: HTTP Error {0} message : {1} while downloading from {2}
fr: Erreur HTTP {0} message : {1} pendant le téléchargement de {2}

source: Cannot do this operation on a layer collection
fr: Opération impossible sur une collection de couches.

source: No row selection in a layer collection
fr: Sélection de ligne impossible dans une collection de couches

source: Could not read bundle manifest
fr: Impossible de lire le manifest du bundle

source: This listener is already registered.
fr: Ce Listener est déjà enregistré

source: The listener stop the event process.
fr: Le déclencheur a annulé l’événement

source: The listener throw an unexpected error
fr: L'écouteur à renvoyé une erreur inattendue

source: Access to the sources, to its properties (indexes, etc.) and its contents, either raster or vectorial
fr: Accèder aux sources, à leurs propriétés (index, etc) et leur contenu, qu'elles soient de type raster ou vecteur

source: Contains folders path
fr: Contient les chemins des dossiers
