Repository: orbisgis/orbisgis
Catalog: orbisgis-view/src/main/resources/org/orbisgis/view/translation/language/*.po
Languages: ar

source: Fatal error on the job named {0}
ar: خطأ فادح على الوظيفة المسماة {0}

source: Progressing...
ar: تقدم ...

source: Invalid MultiLineString
ar: متعدد الخطوط غير صالحة

source: The geometry is not valid
ar: الشكل الهندسي غير صالح

source: Cannot remove a vertex from a point geometry
ar: ا يمكن إزالة ذروة من هندسة نقطية

source: Invalid multipolygon
ar: المضلعات غير صالحة

source: Invalid geometry. Too few vertex
ar: الهندسة غير صالحة. الذروة قليلة جدا

source: The ToolManager cannot listen to source modifications
ar: مدير الأداة لا يستطيع الاستماع إلى تغييرات المصدر

source: Error while drawing the feature,
ar: خطأ أثناء رسم الميزة,

source: Error while accessing data,
ar: خطأ أثناء الوصول إلى البيانات,

source: The current tool is not enabled
ar: لم يتم تفعيل الأداة الحالية

source: Error in the tool.
ar: خطأ في الأداة.

source: Cannot recalculate the handlers
ar: لا يمكن حساب معالجات

source: Invalid MultiPoint
ar: عدة نقاط غير صالحة

source: The MapEditor cannot listen to source modifications
ar: محرر الخريطة لا يستطيع الإستماع إلى تعديلات المصدر

source: Drawing
ar: رسم

source: Tool error {0}
ar: خطأ أداة {0}

source: Unable to compute the zoom extent
ar: لا يمكن تحقيق تكبير موسع

source: Compute envelope of {0}
ar: أحسب مغلف {0}

source: Zoom to the selected geometries
ar: تكبير على الأشكال الهندسية المختارة

source: Open the map context
ar: فتح سياق الخريطة

source: Create a datasource from the current selection
ar: إنشاء مصدر بيانات من الإختيار الحالي

source: {0}_selection
ar: {0} اختيار

source: {0}_selection_{1}
ar: {0} _اختيار_ {1}

source: You must enter a non-empty name.
ar: جب إدخال اسم غير فارغ.

source: A datasource with that name already exists.
ar: مصدر بيانات بهذا الاسم موجود مسبقا.

source: Scale :
ar: مقياس :

source: Projection : {0}
ar: إسقاط: {0}

source: X:{0} Y:{1}
ar: س:{0} ع:{1}

source: The saved map context cannot be read, starting with an empty map context.
ar: لا يمكن قراءة سياق الخريطة، إبدأ بخريطة فارغة.

source: Some layers use temporary data source, are you sure to save this map and loose layers with temporary data sources ?
ar: بعض الطبقات تستخدم مصدر بيانات مؤقتة، هل أنت متأكد من حفظ هذه الخريطة وفقدان الطبقات مع المصادر البيانية المؤقتة؟

source: Temporary layers data source
ar: طبقات مؤقت

source: Some layers use modified data source, do you want to save also these modifications ?
ar: بعض الطبقات تستخدم مصادر بيانات معدلة، هل تريد حفظ هذه التعديلات أيضا؟

source: Save geometry edits
ar: حفظ تعديلات الشكل الهندسي

source: Some layers data source modifications can not be saved, are you sure you want to continue ?
ar: لا يمكن حفظ تعديلات مصدر البيانات، هل أنت متأكد من أنك تريد المتابعة؟

source: Errors on data source save process
ar: أخطاء في عملية حفظ مصدر البيانات

source: Unable to load the map context
ar: غير قادر على تحميل سياق الخريطة

source: MapContext - {0}
ar: سياق الخريطة - {0}

source: Map
ar: الخريطة

source: Map Editor "{0}" [Modified]
ar: خريطة محررة "{0}" [التعديل]

source: Map Editor "{0}"
ar: خريطة محررة "{0}"

source: The value of the scale denominator must be equal or greater than 1
ar: يجب أن تكون قيمة قاسم المقياس مساوية أو أكبر من 1

source: Fail to load the map context, starting with an empty map context
ar: فشل في تحميل خريطة السياق، بدءا مخطط السياق فارغ

source: MyMap.ows
ar: خريطتي.ows

source: Full extent
ar: التكبير الموسع

source: Zoom to show all geometries
ar: تكبير لإظهار كافة الأشكال الهندسية

source: Clear selection
ar: إلغاء التحديد

source: Clear all selected geometries of all layers
ar: إلغاء تحديد كافة الأشكال الهندسية المختارة من جميع الطبقات

source: Zoom to selection
ar: تكبير الاختيار

source: Zoom to visible selected geometries
ar: تكبير على الأشكال المختارة

source: Create datasource from selection
ar: إنشاء مصدر بيانات من الإختيار

source: Mesure tools
ar: أدوات القياس

source: Graphic tools
ar: أدوات الرسم

source: Maps tree
ar: شجرة الخرائط

source: Show/Hide maps tree
ar: إظهار / إخفاء شجرة الخرائط

source: Export map as image
ar: تسجيل الخريطة على شكل صورة

source: Export image as file
ar: تسجيل الصورة على شكل ملف

source: Export parameters
ar: تصدير الإعدادات

source: Transparent background
ar: شفافة خلفية

source: Width (pixels)
ar: الطول (بكسل)

source: Height (pixels)
ar: الارتفاع (بكسل)

source: Keep ratio
ar: حافظ على النسبة

source: Reset extent
ar: إعادة تعيين المدى

source: OK
ar: موافق

source: Cancel
ar: إلغاء

source: Save the map as image :
ar: إحفظ الخريطة على شكل صورة:

source: Portable Network Graphics
ar: رسومات الشبكة المحمولة

source: Tagged Image File Format
ar: ملف الصورة الموسومة

source: Joint Photographic Experts Group
ar: إشراك مجموعة خبراء التصوير

source: Portable Document Format
ar: صيغة الوثائق المحمولة

source: No layers are selected.
ar: لم يتم إختيار أي طبقة

source: Layer {0} has no selected geometries.
ar: الطبقة {0} ليس لديها شكل هندسي محدد.

source: Drawing into file
ar: أرسم في ملف

source: Unable to create and drop the layer
ar: غير قادر على إنشاء وحذف الطبقة

source: A problem occurred while opening the DataSource :
ar: حدوث مشكلة أثناء فتح مصدر البيانات:

source: Load the data source droped into the map editor.
ar: تحميل مصدر البيانات الموجود في محرر الخريطة.

source: Stop
ar: توقف

source: Close the drawing toolbar
ar: إغلاق عارضة أدوات الرسم

source: The edited layer has unsaved changes. Do you want to keep theses modifications ?
ar: تلقّت الطّبقة تعديلات لم يتم حفظها. هل تريد حفظ هذه التّعديلات؟

source: Save modifications
ar: حفظ التعديلات

source: Unable to save the modifications
ar: غير قادر على حفظ التعديلات

source: Undo
ar: إلغاء الأمر

source: Undo the last modification
ar: قم بالغاء التعديل الأخير

source: Save
ar: حفظ

source: Save unsaved modifications of this layer
ar: إحفظ التعديلات التي لم يتم حفظها لهذه الطبقة

source: Delete
ar: حذف

source: Delete selected geometries
ar: حذف الأشكال الهندسية المختارة

source: Are you sure to remove the {0} selected geometries ?
ar: هل أنت متأكد من إزالة {0} الأشكال الهندسية المختارة؟

source: Cancel all unsaved modifications of this layer
ar: إلغاء جميع التعديلات التي لم يتم حفظها من هذه الطبقة

source: Are you sure to cancel all your modifications ?
ar: هل أنت متأكد من إلغاء كل التعديلات؟

source: Return to the original state
ar: العودة إلى الحالة الأصلية

source: Redo
ar: الرجوع إلى الوراء

source: Redo the last modification
ar: إعادة التعديل الأخير

source: Draw a polygon
ar: أرسم المضلع

source: Split polygon
ar: تقسيم المضلع

source: Split a polygon by drawing a line
ar: تحميل محتوى مساحة العمل

source: Cannot split the polygon
ar: لا يمكن تقسيم المضلع

source: Lines must have at least two points
ar: يجب أن تكون نقطتين على الأقل للخطوط

source: Invalid line
ar: خط غير صالح

source: Cannot use wand tool {0}
ar: لا يمكن استخدام الأداة {0}wand

source: Cannot apply the legend {0}
ar: لا يمكن تطبيق المفتاح {0}

source: Error accessing the GeoRaster {0}
ar: دخول خاطأ للجيورستر {0}

source: Error accessing the wand layer datasource {0}
ar: يستحيل

source: Error committing the wand layer datasource {0}
ar: حدوث خطأ أثناء خلق مصدر بيانات الأداة {0}

source: Vectorize a set of pixels
ar: فكتورزي مجموعة من البكسل

source: Problem to access the GeoRaster
ar: مشكلة للوصول إلى GeoRaster

source: Problem adding the new layer
ar: مشكلة أثناء إضافة طبقة جديدة

source: Operation error with the GeoRaster
ar: خطأ في العملية مع GeoRaster

source: Cannot create the resulting layer of raster type
ar: لا يمكن خصم الطبقة المتماثلة مع راستر

source: Compute a watershed
ar: احسب المستجمع المائي

source: Cannot Autocomplete the polygon
ar: لا يمكن الاستكمال الآلي المضلع

source: Autocomplete a polygon
ar: لاستكمال الآلي للمضلع

source: Cannot split line
ar: لا يمكن تقسيم الخط

source: Split line
ar: أقسم الخط

source: Split a line by selecting a vertex
ar: تحميل محتوى مساحة العمل

source: Click a selected vertex to remove it
ar: أنقر على قمة لإزالته

source: Delete vertex
ar: حذف الذروة

source: Select the center of the zoom
ar: حدد مركز التكبير

source: Select the point location
ar: حدد موقع النقطة

source: Select a geometry or draw a selection rectangle
ar: حدد الهندسة أو أرسم مستطيل من التحديد

source: Select the second point
ar: حدد النقطة الثانية

source: Click a handler to move it or select another geometry
ar: حافظ على النقر من أجل التحريك أو حدد هندسة أخرى

source: Place the handler in its new position
ar: ضع المؤشرة في موقعها الجديد

source: Can't find the status of this tool.
ar: لا يمكن العثور على وضع هذه الأداة.

source: Select a feature
ar: حدد المجسم

source: Click on an edge to insert a vertex
ar: انقر القوس لإضافة قمة

source: Add a new vertex
ar: أضف ذروة

source: Terminate multipoint
ar: إنهي متعددة النقاط

source: Select the next point location or terminate multipoint
ar: حدد موقع النقطة التالية أو إنهي متعددة النقاط

source: Draw a multipoint
ar: أرسم عدة نقاط

source: Select the first point of the zooming rectangle
ar: حدد النقطة الأولى من مستطيل التكبير

source: Terminate multipolygon
ar: إنهي متعدد الأضلاع

source: Terminate polygon
ar: إنهى المضلع

source: Select the first point/terminate multipolygon
ar: حدد النقطة الأولى / إنهى متعدد الأضلاع

source: Select the next point/terminate polygon/terminate multipolygon
ar: حدد النقطة التالية / إنهى مضلع / إنهى متعدد الأضلاع

source: Draw a multipolygon
ar: أرسم متعدد الأضلاع

source: Cancel (transition)
ar: إلغاء (الأمر)

source: Terminate line
ar: إنهاء الخط

source: Select the first point
ar: حدد نقطة البداية

source: Select the next point or terminate line
ar: حدد النقطة التالية أو إنهى الخط

source: Select the next point or [T]erminate polygon
ar: حدد النقطة التالية أو [إ]نهى المضلع

source: Select start point
ar: حدد نقطة البداية

source: Drag to destination point
ar: اسحب لنقطة الوصول

source: Terminate multiline
ar: إنهاء متعدد الخطوط

source: Select the first point terminate multiline
ar: حدد النقطة الأولى إنهاء متعدد الخطوط

source: Select the next point terminate line terminate multiline
ar: حدد النقطة الموالية إنهاء خط إنهاء متعدد الخطوط

source: Draw a multiline
ar: أرسم متعدد الخطوط

source: Draw multi-polygon
ar: رسم متعددة المضلّعات

source: Select a geometry
ar: إختر الشكل الهندسي

source: Split line by line
ar: تقسيم خط بخط

source: Split a line by drawing a line
ar: تقسيم خط عن طريق رسم خط

source: Cannot split the line
ar: لا يمكن تقسيم خط

source: Angle : {0}
ar: الزاوية: {0}

source: Mesure angle
ar: قياس الزاوية

source: This tool mesure the angle
ar: هذه الأداة لقياس الزاوية

source: Zoom out
ar: تصغير

source: This tool zoom out on click
ar: هذه الأداة تصغر بنقرة على الفأرة

source: Cannot delete vertex
ar: لا يمكن حذف الذروة

source: Cannot modify the theme
ar: لا يمكن تغير الموضوع

source: Cannot move {0}
ar: لا يمكن أن تحرك {0}

source: Cannot cut the polygon
ar: لا يمكن قطع المضلع

source: Cut a polygon
ar: قطع المضلع

source: Select a polygon then draw another polygon to subtract the first one
ar: اختر مضلع ثم ارسم مضلع آخر لحذف أولهما

source: Coordinate : {0}
ar: إحداثيات : {0}

source: Pick a point
ar: اختيار نقطة

source: Zoom in
ar: قم بالتكبير

source: Click on the map to zoom in
ar: أنقر على الخريطة للتكبير

source: Cannot use fence tool
ar: لا يمكن استخدام الأداة fence

source: Error while recovering fence vectorial layer
ar: خطأ أثناء استعادة fence

source: Cannot create fence layer
ar: لا يمكن إنشاء fence

source: Draw a fence
ar: أرسم fence

source: Get feature attributes
ar: الحصول على السمات

source: Area : {0} Perimeter : {1}
ar: المساحة : {0} المحيط : {1}

source: Mesure area
ar: أحسب المساحة

source: This tool mesure the area
ar: هذه الأداة لقياس المساحة

source: Invalid multiline
ar: متعدد الخطوط غير صالحة

source: Cannot update the geometry {0}
ar: لا يمكن تحديث الشكل الهندسي {0}

source: Move vertex
ar: تحريك الذروة

source: Pan
ar: إزاحة

source: The Pan Tool
ar: أداة الإزاحة

source: Polygons must have more than two points
ar: يجب أن يكون للمضلعات أكثر من نقطتين

source: Invalid polygon
ar: المضلع غير صالح

source: Cannot insert linestring
ar: يتعذر إضافة خط

source: Draw a line
ar: أرسم الخط

source: Distance : {0}
ar: المسافة : {0}

source: This tool mesure the length on the map
ar: هذه الأداة تقيس الطول على الخريطة

source: Mesure length
ar: قياس الطول

source: Draw a point
ar: أرسم نقطة

source: Open the map
ar: إفتح الخريطة

source: Remote
ar: بعيد

source: Cannot load map catalog server {0}
ar: يتعذر تحميل خادم كتالوج الخريطة {0}

source: Enter the server URL
ar: أدخل URL الخادم

source: You type an incorrect URL {0}
ar: أدخلتم URL غير صحيح {0}

source: Add Map Catalog server
ar: أضف خادم كتالوج الخريطة

source: Add a new remote map catalog
ar: أضف كتالوج جديد لخريطة البعد

source: Unlink
ar: فك الرّابط

source: Unlink the folder, without deleting it
ar: فك رابط المجلد، دون حذفه

source: Cannot download the server's workspaces of {0}
ar: لا يمكن تحميل مساحات العمل الخادم من {0}

source: Download the workspaces of {0}
ar: تحميل فضاء العمل {0}

source: Cannot download the server's contexts of {0}
ar: لا يمكن تحميل سياقات الخادم من {0}

source: Download the context of {0}
ar: تحميل السياق من {0}

source: Uploading the map context..
ar: تحميل سياق الخريطة ..

source: The map cannot be removed
ar: لا يمكن إزالة الخريطة

source: Delete the remote map context
ar: حذف سياق الخريطة البعيد

source: Parse maps title and description
ar: حلل العنوان وأصف الخرائط

source: Error while downloading the map content
ar: خطأ أثناء تحميل محتوى الخريطة

source: Downloading..
ar: التحميلات..

source: Map creation failed
ar: فشل إنشاء الخريطة

source: Are you sure you want to delete permanently the selected files ?
ar: هل أنت متأكد أنك تريد حذف الملفات المحددة بشكل دائم؟

source: Remove the files
ar: إزالة الملفات

source: Cannot remove the file
ar: لا يمكن حدف الملف

source: Cannot remove the file {0}
ar: لا يمكن حدف الملف {0}

source: Remove permanently the map
ar: حذف كلي للخريطة

source: Local
ar: محلي

source: Select a folder to link with map manager
ar: تحديد مجلد للربط مع مدير الخريطة

source: Add Map Catalog folder
ar: إضافة مجلّد دليل الخرائط

source: Add link to a local folder
ar: إضافة رابط إلى مجلد محلي

source: Edit the URL
ar: تحرير العنوان URL

source: Remove this server
ar: إزالة هذا الخادم

source: Download the server content
ar: تنزيل محتوى الخادم

source: Are you sure you want to replace the remote map context ?
ar: هل أنت متأكد أنك تريد استبدال سياق الخريطة البعيد؟

source: Overwrite map context confirmation
ar: التأكيد من إعادة كتابة سياق الخريطة

source: Remove this map on the server
ar: إحذف هذه الخريطة من الخادم

source: default
ar: خطا

source: Maps manager
ar: مدير الخرائط

source: Enter the Map file name
ar: أدخل اسم ملف الخريطة

source: MyMap
ar: خريطتى

source: The specified file name already exist
ar: اسم الملف المحدد موجود من قبل

source: The map creation has failed
ar: فشل إنشاء الخريطة

source: New empty map
ar: الخريطة الجديدة فارغة

source: Create a new OWS Map in this folder
ar: أنشئ خريطة جديدة OWS داخل هذا المجلد

source: Download the workspace content
ar: تحميل محتوى مساحة العمل

source: Cannot initialize beanshell
ar: لا يمكن تهيئة beanshell

source: Cannot initialize beanshell script folder
ar: لا يمكن تهيئة المجلد النصي لل beanshell

source: Do you want to clear the contents of the console?
ar: هل تريد مسح محتويات وحدة التحكم؟

source: Clear script
ar: إمسح السيناريو

source: Execute
ar: تنفيذ

source: Execute the java script
ar: تنفيذ جافا سكريبت

source: Clear
ar: أزل

source: Erase the content of the editor
ar: مسح محتوى المحرر

source: Open
ar: افتح

source: Load a file in this editor
ar: قم بتحميل الملف في هذا المحرر

source: Save the editor content into a file
ar: حفظ محتوى المحرر في ملف

source: Search..
ar: البحث ..

source: Search text in the document
ar: إبحث عن النص في المحرر

source: (Un)comment
ar: (بدون)تعليق

source: (Un)comment the selected text
ar: (بدون)التعليق على النص المحدد

source: Block (un)comment
ar: الكتلة (بدون)تعليق

source: Block (un)comment the selected text.
ar: الكتلة (بدون)التعليق على النص المحدد.

source: Save script
ar: حفظ السيناريو

source: BeanShell Script (*.bsh)
ar: BeanShell نصي (*.bsh)

source: IO error.
ar: خطأ دخول/ خروج

source: The file has been saved.
ar: لقد تم حفظ الملف.

source: Open script
ar: فتح السيناريو

source: Do you want to clear all before loading the file ?
ar: هل تريد مسح كلي قبل تحميل الملفات؟

source: Open file
ar: فتح الملف

source: Cannot execute the script
ar: لا يمكن تنفيذ البرنامج النصي

source: The script is not valid
ar: البرنامج النصي غير صالح

source: Not contains
ar: لا يحتوي

source: Alphanumeric
ar: الابجدية الرقمية

source: DataBase
ar: قاعدة المعلومات

source: Files
ar: ملفات

source: Geometry
ar: الهندسة

source: Raster
ar: النقطية

source: Vectorial
ar: اتجاهي

source: Web Map Services
ar: Web خدمات الخريطة

source: System Table
ar: جدول النظام

source: Source type is
ar: نوع المصدر هو

source: Contains
ar: يحتوي

source: Data source schema could not be read
ar: لا يمكن قراءة مخطط مصدر البيانات

source: GeoCatalog
ar: الجيوكاتالوج

source: Add filter
ar: إضافة مرشح

source: Add a new data source filter
ar: إضافة مرشح جديد

source: Select the file to add
ar: تحديد الملف لإضافة

source: This source was already registered
ar: هذا المصدر مسجل من قبل

source: All data source of the GeoCatalog will be removed. Are you sure ?
ar: ستتم إزالة كافة البيانات من المصدر جيوكاتالوج . هل أنت متأكد؟

source: Clear the GeoCatalog
ar: مسح الجيوكاتالوج

source: Cannot remove the source {0}
ar: لا يمكن إزالة مصدر {0}

source: Save the source :
ar: حفظ المصدر:

source: Add files from a folder
ar: إضافة ملفات من مجلد

source: Add from folder
ar: إضافة من مجلد

source: Cannot find a valid image format for this WMS server
ar: لا يمكن العثور على شكل صورة صالحة لهذا الخادم WMS

source: Can't read the given URI:
ar: لا يمكن قراءة URL

source: The given URI contains illegal character
ar: URL لا يحتوي على طابع غير قانوني

source: The source is already registered :
ar: المصدر مسجل مسبقا

source: Add
ar: إضافة

source: File
ar: ملف

source: Add a file from hard drive.
ar: أضيف ملف من القرص الصلب.

source: Folder
ar: مجلد

source: Add a set of file from an hard drive folder.
ar: إضافة مجموعة من الملفات من مجلد القرص الصلب.

source: Add one or more tables from a DataBase
ar: ضافة جدول واحد أو أكثر من قاعدة البيانات

source: WMS server
ar: خادم WMS

source: Add a WebMapService
ar: إضافة خدمة ويب الخريطة

source: Save selected sources in files
ar: إحفظ المصادر المختارة في ملفات

source: Database
ar: قاعدة المعلومات

source: Save selected sources in a data base
ar: أحفظ المصادر المحددة في قاعدة البيانات

source: Open the attributes
ar: فتح الصفات

source: Open the data source table
ar: إفتح جدول مصدر البيانات

source: Remove the source
ar: نقل المصدر

source: Remove from this list the selected sources.
ar: إحذف من هذه القائمة المصادر المحددة.

source: Remove all sources in this list
ar: إحذف جميع المصادر من هذه القائمة

source: Source {0}
ar: المصدر {0}

source: Cannot save the source modifications
ar: لا يمكن حفظ تعديلات المصدر

source: Saving the source in a database.
ar: حفظ المصدر في قاعدة بيانات.

source: Save sources in a database
ar: حفظ المصادر في قاعدة بيانات

source: Close
ar: أغلق

source: Please connect to a database
ar: من فضلك الاتصال بقاعدة بيانات

source: At least one row must be checked.
ar: يجب تحديد صف واحد على الأقل.

source: Cannot connect to the database.
ar: لا يمكن الربط بقاعدة البيانات

source: Please set a password
ar: من فضلك تعيين كلمة مرور

source: Login
ar: تسجيل الدخول

source: Password
ar: كلمة السر

source: The login cannot be empty.
ar: تسجيل الدخول لا يمكن أن يكون فارغا.

source: The password cannot be empty.
ar: يجب إدخال كلمة السر

source: Cannot connect the database
ar: لا يمكن الاتصال بقاعدة البيانات

source: Connection parameters
ar: معلمات الاتصال

source: Connexion name
ar: إسم الإتصال

source: MyConnexion
ar: إتصالي

source: Type of database
ar: نوع قاعدة البيانات

source: Host
ar: مضيف

source: Default port
ar: المنفذ الافتراضي

source: Database name
ar: إسم قاعدة البيانات

source: Please specify a connexion name
ar: من فضاك حدد إسم الإتصال

source: The database name is mandatory
ar: اسم قاعدة البيانات إجباري

source: The host cannot be null
ar: المضيف لا يمكن أن يكون فارغ

source: The port field is mandatory
ar: عدد المنفذ إجباري

source: The port number must lie between 0 and 32767.
ar: رقم المنفذ يجب أن يكون محصور بين 0 و 32767.

source: The port number must be comprise between 0 and 32767
ar: رقم المنفذ يجب أن يكون محصور بين 0 و 32767

source: This table does not exist.
ar: هذا الجدول غير موجود

source: The required DataSource could not be created.
ar: لا يمكن إنشاء مصدر البيانات المطلوبة.

source: Open tables or views from a database
ar: افتح جداول أو مشاهد قاعدة البيانات

source: Please set the user name and a password
ar: يرجى إدخال اسم المستخدم وكلمة السر

source: The database contains any tables or views.
ar: فاعدة البيانات لا تحتوي على جداول أو مشاهد.

source: At least one table or view must be selected.
ar: يجب على الأقل إختيار جدول أو مشهد.

source: Tables
ar: جداول

source: Views
ar: مشاهد

source: Cannot list the tables and views
ar: لا يمكن سرد الجداول ولا المشاهد

source: Cannot open the connection
ar: لا يمكن فتح الإتصال

source: Populating the database list...
ar: ملء قائمة قاعدة البيانات ...

source: Connect to the database
ar: إتصل بقاعدة البيانات

source: Disconnect
ar: إقطع الاتصال

source: Add a new connection
ar: إضافة اتصال جديد

source: Edit the connection
ar: قم بتعديل الإتصال

source: Remove the connection
ar: قم بإزالة الإتصال

source: Saved with the OrbisGIS database panel
ar: إحفظ مع لوحة قاعدة بيانات OrbisGIS

source: There is already a connection with this name.
ar: هناك اتصال سابق مع هذا الاسم.

source: Cannot format the EPSG code into an int. The default code will be used.
ar: لا يمكن تهيئة رمز EPSG إلى int. سيتم استخدام الرمز الافتراضي.

source: Choose a list of layers
ar: إختيار لائحة الطبقات

source: At least a layer must be selected
ar: على الأقل يجب تحديد طبقة

source: WMS server URL
ar: URL خادم WMS

source: Connect to the server.
ar: الاتصال بالخادم

source: Delete the server connection.
ar: حذف الاتصال بالخادم.

source: Reload the server connection.
ar: إعادة تحميل الاتصال بالخادم.

source: Cannot update and save the URL list
ar: لا يمكن تحديث وحفظ قائمة URL

source: Information
ar: معلومات

source: Version :
ar: النسخة:

source: Name :
ar: اسم :

source: Cannot load the list of WMS url
ar: لا يمكن تحميل قائمة WMS url

source: Cannot save the list of WMS url
ar: لا يمكن حفظ قائمة WMS url

source: WMS server connection
ar: الاتصال بالخادم WMS

source: Please connect to the WMS server
ar: من فضلك الاتصال بخادم WMS

source: Cannot connect to {0}
ar: يتعذر الربط بـ {0}

source: Cannot get capabilities of {0}
ar: لا يمكن الحصول على قدرات {0}

source: Connecting to the server...
ar: الاتصال بالخادم ...

source: Select a SRS
ar: اختيار SRS

source: Search a SRS :
ar: ابحث عن SRS:

source: Please select a SRS.
ar: من فضلك حدد SRS.

source: Save the source in a file.
ar: حفظ المصدر في الملف.

source: The datasource has been exported and added to the geocatalog with the name
ar: قد تم تحويل مصدرالبيانات وإضافته إلى الجيوكتالوج مع التسمية

source: Cannot create the file
ar: لا يمكن خلق الملف

source: Cannot read the source
ar: لا يمكن قراءة المصدر

source: Unable to find appropriate icon for typeCode {0}
ar: غير قادر على العثورعلى الأيقونة المناسبة لنوع الرمز {0}

source: Error while drawing the Toc tree
ar: خطأ أثناء رسم شجرة Toc

source: Min scale greater than max scale in rule {0}.
ar: سلم الحد الأدنى أكبر من سلم الحد الأعلى في القاعدة {0}.

source: Advanced Style Editor
ar: محرر من نمط متقدم

source: Up
ar: فوق

source: Down
ar: تحت

source: Rename
ar: إعادة تسمية

source: Choose a name for your rule
ar: اختيار اسم للقاعدة الخاصة بك

source: Name of the Rule :
ar: اسم القاعدة:

source: Rule name cannot be null or empty.
ar: اسم القاعدة لا يمكن أن يكون فارغا أو صفر.
