Repository: orbisgis/orbisgis
Catalog: orbisgis-view/src/main/resources/org/orbisgis/view/translation/language/*.po
Languages: ar

source: Add or select a legend.
ar: أضف أو حدد المفتاح.

source: Simple Style Editor - {0}
ar: محرر من نمط بسيط - {0}

source: You must create at least one legend
ar: يجب إنشاء مفتاح واحد على الأقل

source: Area Symbolizer
ar: رمز سطحي

source: Line Symbolizer
ar: رمز خطي

source: Point Symbolizer
ar: رمز نقطي

source: Text Symbolizer
ar: رمز نصي

source: Create a thematic map
ar: إنشاء خريطة موضوعية

source: The name shall not be empty.
ar: الإسم لا يمكن أن يكون فارغا.

source: Name
ar: اسم

source: Value
ar: قيمة

source: Preview
ar: عرض مسبق

source: Threshold
ar: حد

source: Label
ar: علامة

source: You must use recognized RecodedLine instances in this panel.
ar: يجب أن تستخدم سطر الحالات المشفّرة المعترف بها في هذه اللّوحة.

source: Rule settings
ar: إعدادات القاعدة

source: Min. scale
ar: مقياس الحد الأدنى.

source: Current
ar: متداول

source: Max. scale
ar: مقياس الحد الأقصى.

source: Min. scale is not a valid number
ar: الحد الأدنى للمقياس ليس رقم صالح

source: Max. scale is not a valid number
ar: الحد الأقصى للمقياس ليس رقم صالح

source: You must use recognized RecodedArea instances in this panel.
ar: يجب أن تستخدم مجال الحالات المشفّرة المعترف بها في هذه اللّوحة.

source: Style settings
ar: إعدادات النمط

source: Can't build the analysis with an accurate comparator.
ar: لا يمكن إنشاء تحليل مع مقارنة دقيقة.

source: Use the fallback color
ar: استخدام اللون المعتمد

source: Use a color scheme:
ar: استخدام نظام الألوان:

source: Create
ar: خلق

source: Unique value classification
ar: تصنيف القيمة الفريدة

source: Retrieving classes
ar: استرجاع الفئات

source: The application has ended unexpectedly
ar: التطبيق قد انتهى بشكل غير متوقع

source: Continue ?
ar: المتابعة؟

source: <html><p>The analysis seems to generate more than
ar: <HTML> <p> ويبدو أن التحليل أنتج أكثر من

source: different values...</p><p>Are you sure you want to continue ?</p></html>
ar: قيم مختلفة ... <p/ ><p> هل أنت متأكد أنك تريد المتابعة؟ </ P> </ HTML>

source: Operation in progress...
ar: العملية في التقدم ...

source: Interval classification
ar: تصنيف الفاصل

source: Method
ar: الطريقة

source: Classes
ar: الفئات

source: Color scheme:
ar: ألون مركبة

source: Stroke and fill settings
ar: تنظيم الحاشية و إعادة الملء

source: Max. size
ar: قياس حد أقصى

source: Min. size
ar: قياس حد أدنى

source: General settings
ar: الإعدادات العامة

source: Fallback symbol
ar: رمز معتمد

source: Color
ar: لون

source: Max width
ar: عرض أقصى

source: Min width
ar: عرض أدنى

source: Enable
ar: يسمح

source: Remove
ar: حذف

source: Could not validate your input.
ar: لا يمكن التحقق من صحة معطياتك.

source: Gradient
ar: مقياس

source: to
ar: إلى

source: Couldn't find file
ar: لا يمكن العثور على الملف

source: Select Legend
ar: حدد المفتاح

source: You must select a legend.
ar: يجب عليك تحديد المفتاح.

source: Can't recognize this flavour
ar: لا يمكن التعرف على هذه النكهة

source: Problem during the transfer
ar: مشكلة أثناء النقل

source: Cannot change the layer name
ar: لا يمكن تغيير اسم الطبقة

source: Layer:{0} DataSource :({1})
ar: طبقة: {0} مصدر البيانات: ({1})

source: Toc
ar: توك

source: Save the Map
ar: احفظ الخريطة

source: Zoom to
ar: تكبير إلى

source: Zoom to the layer bounding box
ar: تكبير على مسقط الطبقة

source: Zoom to selected geometries
ar: تكبير الأشكال الهندسية المختارة

source: Clear the selected geometries
ar: إلغاء تحديد الأشكال الهندسية المختارة

source: Import style
ar: استيراد أسلوب

source: Import a style from a file.
ar: استيراد أسلوب من ملف.

source: Add a new legend.
ar: اضف مفتاح جديد.

source: Open a spreadsheet view of the attributes.
ar: إفتح الجدول المشارك

source: Start editing
ar: البدء في التحرير

source: The edit geometry toolbar will update this layer's data source.
ar: قاعدة الأدوات الخاصة بتحرير الشكل الهندسي ستقوم بتحديث هذه الطبقة.

source: Stop editing
ar: إيقاف التحرير

source: Close the edit geometry toolbar.
ar: أغلق قاعدة الأدوات الخاصة بتحرير الشكل الهندسي.

source: Apply the data source modifications
ar: طبق تعديلات مصدر البيانات

source: Cancel modifications
ar: إلغاء التعديلات

source: Undo all data source modifications
ar: ألغي كل تعديلات مصدر البيانات

source: Add layer group
ar: أضف مجموعة من الطبقات

source: Add layer group to the map context
ar: إضافة مجموعة طبقات الى سياق الخريطة

source: Remove layer
ar: إزالة الطبقة

source: Remove the layer from the map context
ar: إزالة الطبقة من السياق الخريطة

source: Add a legend in this style
ar: أضف تحليل لإضاحة هذا الأسلوب

source: Simple style editor
ar: محرر نمط بسيط

source: Open the simple editor for SE styles
ar: افتح محرر بسيطة للأسلوب SE

source: Advanced style editor
ar: محرر نمط متقدم

source: Open the advanced editor for SE styles
ar: إفتح المحرر المتقدم للأنماط SE

source: Remove style
ar: إزالة الاسلوب

source: Remove this style from the associated layer.
ar: حذف هذا النمط من الطبقة المرتبط بها.

source: Export style
ar: تصدير الاسلوب

source: Export this style from the associated layer.
ar: تصدير هذا النمط من الطبقة المرتبطة بها.

source: Cannot drop layer on {0}
ar: لا يمكن إزالة الطبقة على {0}

source: Drop unknown editable of type : {0}
ar: مستند مجهول من النوع : {0}

source: Can not add a LayerCollection : {0}
ar: لا يمكن إضافة مجموعة من الطبقة : {0}

source: Some layers use modified data source, do you want to save these modifications before removing them ?
ar: بعض الطبقات تستخدم مصدر من البيانات المعدلة، هل تريد حفظ هذه التعديلات قبل حذفها؟

source: The layer data source {0} can not be saved, are you sure you want to continue ?
ar: مصدر البيانات {0} لا يمكن حفظه، هل أنت متأكد من أنك تريد المتابعة؟

source: Cannot delete layer
ar: لا يمكن حذف الطبقة

source: This functionality is not supported.
ar: هذه الوظيفة غير معتمدة.

source: Advanced Editor can't be loaded
ar: المحرر المتقدم لا يمكن تحميله

source: Error while editing the legend
ar: خطأ أثناء تحرير المفتاح

source: You produced an invalid style while copying a valid one. Things are getting really wrong here.
ar: أنتجتم أسلوب غير صالح أثناء نسخ أسلوب آخر صالح. الأمور تزداد خطأ هنا حقا.

source: Styles can be set only on vector layers.
ar: هذا الأسلوب يطبق على الطبقات الشعاعية فقط.

source: The style you're trying to edit is not valid !
ar: الأسلوب الذي كنت تحاول تعديله غير صالح !

source: An error occurred while processing the DataSource
ar: حدوث خطأ أثناء عملية معاينة مصدر البيانات

source: Cannot create the user interface for this style. Please uses the advanced style editor.
ar: لا يمكن إنشاء واجهة مرئية لهذا الاسلوب. يرجى إستخدام محرر متقدم.

source: Link the editable element with the Toc
ar: أربط العنصر القابل للتحرير مع توك

source: Cannot add the layer to the destination
ar: لا يمكن إضافة طبقة إلى المقصد

source: Load the data source droped into the toc.
ar: تحميل مصدر البيانات.

source: Running jobs
ar: تشغيل الوظائف

source: Running jobs ({0})
ar: تشغيل الوظائف ({0})

source: Executing script
ar: نفذ السيناريو

source: Execution time: {0}
ar: وقت التنفيذ: {0}

source: Run SQL statements
ar: تشغيل عبارات SQL

source: Quote
ar: اقتبس

source: Quote selected text
ar: اقتبس من النص المختار

source: Un Quote
ar: إحذف المزدوجتين

source: Un Quote selected text
ar: إحذف المزدوجتين للتحديد

source: Format
ar: الشكل

source: Format editor content
ar: جهز محتوى المحرر

source: SQL list
ar: قائمة SQL

source: Show/Hide SQL function list
ar: إظهار / إخفاء قائمة الدالة SQL

source: SQL script (*.sql)
ar: السيناريو SQL (*. SQL

source: Functions count = {0}
ar: عدد الدالة = {0}

source: SQL Console
ar: وحدة تحكم SQL

source: Add a row
ar: قم بإضافة صف

source: New row
ar: صف جديد

source: Table "{0}"
ar: الجدول "{0}"

source: Find
ar: أجد

source: All
ar: كل

source: Match case
ar: إحترم الفراغ

source: Whole words
ar: كلمات كاملة

source: Search
ar: ابحث

source: Filter driver error
ar: خطأ في الفلتر

source: Run SQL request
ar: طلب تشغيل SQL

source: Selecting rows
ar: إختر السطر

source: Computation of the optimal column width
ar: حساب العرض الأمثل للعمود

source: Compute column statistics.
ar: احسب إحصائيات العمود.

source: Driver error
ar: خطأ السائق

source: Aborted by user
ar: قطع من قبل المستخدم

source: Cache table values
ar: قيم الجدول المؤقت

source: Sorting {0}
ar: فرز {0}

source: Unable to establish the selection bounding box
ar: يتعذر تأسيس مربع المحيط بالتحديد

source: Remove a column
ar: قم بحذف العمود

source: Are you sure you want to remove the column {0} ?
ar: هل أنت متأكد أنك تريد حذف العمود {0}؟

source: Deletion of a column
ar: حذف العمود

source: Add a column
ar: قم بإضافة عمود

source: This data source ({0}) is already shown in an editor.
ar: هذا مصدر بيانات ({0}) قد ظهرمن قبل في محرر.

source: In a consequence of an unreachable data source {0},the associated data editor could not be recovered.
ar: نتيجة لمصدر بيانات غير قابلة للوصول {0}،محرر البيانات المرتبط بها لم يتمكن من إسترادها.

source: Delete selected rows
ar: إحذف السطور المختارة

source: Are you sure to remove the {0} selected rows ?
ar: هل أنت متأكد من إزالة {0} الصفوف المحددة؟

source: This table use modified data source, do you want to save these modifications before closing it ?
ar: هذا الجدول يستخدم مصدر بيانات معدلة، هل تريد حفظ هذه التعديلات قبل إغلاقه؟

source: Unsaved modifications
ar: لم يتم حفظ التعديلات

source: The data source {0} can not be saved, are you sure you want to continue ?
ar: مصدر البيانات {0} لا يمكن حفظه، هل أنت متأكد من أنك تريد المتابعة؟

source: Canceled by user
ar: إلغاء من قبل المستخدم

source: Searching request is already launched. Please wait a moment, or cancel it.
ar: جاري طلب البحث. من فضلك انتظر لحظة، أو إلغائه.

source: Filter selected rows
ar: تصفية الأسطر المختارة

source: Show only the selected rows
ar: أظهر الأسطر المختارة فقط

source: Clear row filter
ar: إمسح فلتر السطر

source: Show all rows
ar: أظهر كل الصفوف

source: Deselect all lines
ar: إلغاء كافة الأسطر

source: Reverse selection
ar: أعكس الإختيار

source: Reverse the current selection
ar: أعكس الاختيار الحالي

source: In the map editor, zoom to the selected rows
ar: في الخريطة، كبر في الصفوف المختارة

source: Select same cell
ar: اختر نفس الخلايا

source: Select all rows that match this cell value
ar: اختيار كل الصفوف التي لها نفس القيمة

source: Optimal width
ar: العرض الأمثل

source: Sort ascending
ar: فرز تصاعدي

source: Sort descending
ar: فرز تنازلي

source: No sort
ar: بدون فرز

source: Show column informations
ar: أظهر المعلومات

source: Show column statistics
ar: أظهر الإحصاءات

source: Show column selection statistics
ar: أظهر إحصائيات الإختيار

source: Show filtered column statistics
ar: أظهر إحصائيات الأعمدة المختارة

source: Table Editor of {0} {1}/{2}
ar: محرر جدول {0} {1} / {2}

source: Table Editor of {0} (Filtered) {1}/{2}
ar: محرر جدول {0} (المصفاة) {1} / {2}

source: Error while loading the table editor
ar: خطأ أثناء تحميل الجدول

source: Open the data source {0}
ar: فتح مصدر البيانات {0}

source: Selection deserialisation failed
ar: فشل إلغاء تسلسل التحديد

source: Selection serialisation failed
ar: فشلت اختيار التسلسل

source: The TableEditor cannot listen to source modifications
ar: المحرر لا يستطيع تتبع تغيرات المصدر

source: Cannot parse number
ar: لا يمكن تحليل الرقم

source: &Copy
ar: &نسخ

source: Clea&r
ar: إزال&ة

source: Cannot show the log message
ar: لا يمكن إظهار رسالة التسجيل

source: Output
ar: الناتج

source: Clear all
ar: إزالة الكل

source: Clear all log panels
ar: قم بإزالة جميع لوحات التسجل

source: Errors
ar: أخطاء

source: Infos
ar: معلومات

source: Warnings
ar: تحذيرات

source: Debug
ar: التصحيح

source: Switch to another workspace
ar: قم بالتبديل إلى مساحة عمل أخرى

source: OrbisGIS version {0} {1} {2}
ar: نسخة OrbisGIS {0} {1} {2}

source: &File
ar: &ملف

source: &Exit
ar: &خروج

source: &Tools
ar: &الأدوات

source: &Configuration
ar: &مواصفات

source: Loading GDMS..
ar: تحميل GDMS ..

source: Contains view folders path
ar: يحتوي مسار عرض المجلدات

source: Register GUI Sql functions..
ar: تحميل وظائف SQL المتعلقة بالواجهة المرسومة

source: Load the plugin framework..
ar: تحميل البرنامج الإضافي ..

source: Loading of plugins is aborted
ar: تم إحباط تحميل الإضافات

source: &Save
ar: إحفظ

source: Save the workspace
ar: إحفظ فضاء العمل

source: Error while loading dialogs informations.
ar: خطأ أثناء التحميل المعلومات في علب الحوار.

source: Execute tasks in background processes, showing progress bars. Gives access to the job queue
ar: تنفيذ المهام في العمليات الخلفية، والتي تبين أشرطة التقدم. يتيح الوصول إلى قائمة انتظار العملية

source: Use this instance to open an editable element (map,data source..)
ar: استخدم هذا المثال لفتح عنصر قابل للتحرير (خريطة، مصدر البيانات ..)

source: Loading the main window
ar: تحميل النافذة الرئيسية

source: Loading docking system and frames
ar: تحميل إطار العمل

source: Restore the former layout..
ar: إعادة تصميم الشكل

source: Error while saving dialogs informations.
ar: خطأ أثناء حفظ معلومات علبة الحوار.

source: The workspace has been saved.
ar: لقد تم حفظ فضاء العمل.

source: The workspace hasn't been saved.
ar: لم يتم حفظ فضاء العمل.

source: OrbisGIS needs at least a java 1.7+
ar: OrbisGIS يحتاج على الأقل جافا 1.7+

source: Use Proxy
ar: إستخدام الوكيل

source: Proxy url
ar: URL الوكيل

source: Proxy port
ar: وكيل المنفذ

source: The proxy port is invalid
ar: وكيل المنفذ غير صالح

source: Windows
ar: نافذة

source: Web configuration
ar: ترتيب الشبكة

source: Proxy
ar: الوكيل

source: &Look And Feel
ar: &مظهر و سلوك

source: &Windows
ar: &نافذة

source: ToolBar item {0} is not unique, it has been renamed to {1}
ar: بند شريط الأدوات {0} ليس فريد من نوعه، وقد تم تسميته {1}

source: Choose the workspace folder
ar: اختر مساحة العمل

source: Choose a previous OrbisGIS workspace or create a new one
ar: اختيار مساحة عمل سابقة أو قم بإنشاء واحدة جديدة

source: Set as default?
ar: تعيين افتراضي؟

source: Setting this workspace as default will allow you to skip this dialog next time
ar: تحديد هذا الفضاء للعمل افتراضيا يسمح لك بتفادي فتح هذه النافذة في المرة القادمة

source: Workspace Manager
ar: مدير مساحة العمل

source: Problem updating the workspace.
ar: مشكلة في تحديث مساحة العمل.

source: The workspace folder version is invalid (!=OrbisGIS {0}), or the folder is not empty
ar: ، أو المجلد غير فارغ (! = OrbisGIS {0}) إصدار مجلد مساحة العمل غير صالح

source: Save documents
ar: قم بحفظ المستندات

source: Save the selected documents, and close this dialog if there is no more modifed documents
ar: إحفظ الوثائق المختارة، وأغلق هذا الحوار إذا لم يكن يعد هناك وثائق معدلة

source: Save &All
ar: إحفظ الكل

source: Save all documents and close this dialog
ar: إحفظ جميع الوثائق وإغلاق هذا الحوار

source: Save &None
ar: لا تحفظ شيء

source: Discard all changes and close this dialog
ar: قم بإلغاء كل التغييرات و قم بإغلاق نافذة الحوار

source: &Cancel
ar: &الغاء

source: Do nothing and lose nothing
ar: لا تفعل شيئ و لا تخسر شيئ

source: The document {0} cannot be saved due to the following error {1}
ar: المستند {0} لا يمكن حفظه بسبب الخطأ التالي {1}

source: The URL is not valid.
ar: عنوان الموقع غير صالح.

source: The workspace doesn't exist. Please contact the administrator of the service.
ar: مساحة العمل غير موجودة. يرجى الاتصال بالمسؤول عن الخدمة.

source: The URL is not valid or the service not available.
ar: عنوان الموقع غير صالح أو الخدمة غير متوفرة.

source: A function to share the current mapcontext in the mapcatalog service The second permits to set the workspace name. If the workspace doesn't exist a message appears.
ar: وظيفة لتقاسم سياق الخريطة الحالية في خدمة فهرس الخرائط. الثانية تسمح بتعيين اسم مساحة العمل. في حالة عدم وجود مساحة العمل تظهر رسالة.

source: Return the current mapcontext bounding box as a geometry
ar: تحويل سياق الخريطة الحالي المحاط بمربّع إلى شكل هندسي

source: Cannot import the style
ar: لا يمكن استيراد النمط

source: Cannot add the layer to the mapcontext
ar: لا يمكن إضافة الطبقة إلى السياق الخريطة

source: A function to add a layer based on a table name The second argument is optional. It permits to set a style to the layer.
ar: انها تسمح بتعيين نمط للطبقة. الوسيطة الثانية اختيارية. وظيفة لإضافة طبقة على أساس اسم الجدول.

source: Cannot compute the full extent
ar: لا يمكن حساب النطاق الكامل

source: Zoom to according a dataset
ar: تكبير وفقا للبيانات

source: Problem when checking for an unbroken range of comments
ar: خطأ أثناء التحقق من وجود مجموعة متواصلة من التعليقات

source: Assuming the selection is not already block commented.
ar: لم يتم التعليق على التحديد.

source: Invalid length or offset when trying to uncomment code.
ar: خطأ أثناء محاولة وضع التعليقات.

source: Constraints
ar: العراقيل

source: Changing the type will remove all constraints. Do you want to continue?
ar: غير النوع أزال كافة القيود. هل ترغب في الاستمرار؟

source: Continue?
ar: المتابعة؟

source: Type
ar: نوع

source: Enter the {0} constraint parameter
ar: أدخل إعداد القيد{0}

source: Raster not supported
ar: نقطية غير معتمد

source: Select the constraint
ar: حدد العائق

source: Edit
ar: تحرير

source: The entered value cannot be parsed
ar: لا يمكن تحليل القيمة التي تم إدخالها

source: Cannot list the directory content
ar: لا يمكن سرد محتوى الدليل

source: Cannot remove the folder {0}
ar: لا يمكن إزالة المجلد {0}

source: The path {0} has been copied to the clipboard
ar: تم نسخ المسار {0} إلى الحافظة

source: Could not copy the folder path to the clipboard
ar: لا يمكن نسخ مسار المجلد إلى الحافظة

source: Copy the path
ar: إنسخ المسار

source: Copy the folder path in the clipboard
ar: إنسخ مسار المجلد في الحافظة

source: Update the content of this folder from the file system
ar: تحديث محتوى هذا المجلد من نظام الملفات

source: New folder
ar: مجلد جديد

source: Create a sub-folder
ar: إنشاء مجلد فرعي

source: Remove permanently the folder
ar: أزل المجلد بشكل دائم

source: Enter the folder name
ar: أدخل اسم المجلد

source: The folder creation has failed
ar: فشل إنشاء المجلد

source: Destination file {0} already exists, cannot move {1}
ar: وجهة الملف {0} موجودة بالفعل, لا يمكن تحريك {1}

source: Drop the content in the folder..
ar: وضع المحتويات في المجلد ..

source: Search replace
ar: إبحث و إستبدل

source: Text not found !
ar: النص غير موجود!

source: &Find
ar: إبحث

source: &Replace
ar: إستبدل

source: Replace &All
ar: إستبدل الكل

source: &Close
ar: أغلق

source: &Match Case
ar: طابق الحالة

source: &Whole Words
ar: الكلمات كلها

source: Regular E&xpressions
ar: التعبيرات المنتظمة

source: M&ark all
ar: إختر الكل

source: Search &up
ar: إبحث لأعلى

source: Search &down
ar: إبحث لأسفل

source: Find what:
ar: إبحث :

source: Replace with:
ar: استبدال ب:

source: The provided filter factory name has not been registered
ar: لم يتم تسجيل الفلتر

source: Delete this filter
ar: قم بإزالة الفلتر

source: Add a new filter
ar: أضف فلتر
