Repository: orbisgis/orbisgis
Catalog: workspace-gui/src/main/resources/org/orbisgis/wkgui/translation/language/*.po
Languages: it, pt

source: Fatal error on the job named {0}
it: Errore fatale nelll'attività {0}
pt: Ocorreu um erro catastrófico no trabalho de nome {0}

source: Progressing...
it: Elaborando...
pt: Em progresso...

source: Invalid MultiLineString
it: Multilinea non valida
pt: MultiLineString inválida

source: The geometry is not valid
it: La geometria non è valida
pt: A geometria não é válida

source: Cannot remove a vertex from a point geometry
it: Impossibile rimuovere un vertice da una geometria costituita da un solo punto
pt: Não é possível remover um vértice de uma geometria de ponto

source: Invalid multipolygon
it: Multipoligono non valido
pt: Multipolígono inválido

source: Invalid geometry. Too few vertex
it: Geometria non valida. Troppi pochi vertici
pt: Geometria inválida. Há muito poucos vértices

source: The ToolManager cannot listen to source modifications
it: Il gestore degli strumenti non può rilevare modifiche alla sorgente
pt: O gerenciador de ferramentas não pode escutar modificações de fonte

source: Error while drawing the feature,
it: Errore durante il disegno,
pt: Ocorreu erro ao desenhar o recurso,

source: Error while accessing data,
it: Errore nell'accesso ai dati,
pt: Ocorreu erro ao acessar os dados,

source: The current tool is not enabled
it: Questo strumento non è attivo
pt: A ferramenta atual não está habilitada

source: Error in the tool.
it: Errore nello strumento.
pt: Erro na ferramenta.

source: Cannot recalculate the handlers
it: Impossibile contattare i gestori
pt: Não foi possível recalcular os manipuladores

source: Invalid MultiPoint
it: Multipunto non valido
pt: MultiPoint inválido

source: The MapEditor cannot listen to source modifications
it: L'editor di tabelle non può rilevare modifiche alla sorgente
pt: O editor de mapas não pode escutar modificações de fonte

source: Drawing
it: Disegno
pt: Desenho

source: Tool error {0}
it: Errore nello strumento {0}
pt: Erro da ferramenta {0}

source: Unable to compute the zoom extent
it: Impossibile ingrandire
pt: Não foi possível calcular a extensão de ampliação

source: Compute envelope of {0}
it: Calcolo il valore di {0}
pt: Calcular envelope de {0}

source: Zoom to the selected geometries
it: Ingrandisci le geometrie selezionate
pt: Ampliar para as geometrias selecionadas

source: Open the map context
it: Apri contenuto mappa
pt: Abrir o contexto de mapa

source: Create a datasource from the current selection
it: Crea una sorgente dati dalla selezione corrente
pt: Criar uma fonte de dados a partir da seleção atual

source: {0}_selection
it: {0}_selezione
pt: {0}_seleção

source: {0}_selection_{1}
it: {0}_selezione_{1}
pt: {0}_seleção_{1}

source: You must enter a non-empty name.
it: Devi immettere un nome non vuoto.
pt: Você deve digitar um nome que não seja vazio.

source: A datasource with that name already exists.
it: Esiste già una sorgente dati con quel nome.
pt: Já existe uma fonte de dados com esse nome.

source: Change coordinate reference system
it: Cambia le coordinate del sistema di riferimento
pt: Alterar o sistema de referências de coordenadas

source: Scale :
it: Scala:
pt: Escala :

source: Projection : {0}
it: Proiezione : {0}
pt: Projeção : {0}

source: The format of a scale is 1:number
it: Il formato della scala è 1:numero
pt: O formato de uma escala é 1:número

source: The only accepted value on nominator is 1
it: L'unico valore accettato dal denominatore è 1
pt: O único valor aceito no numerador é 1

source: The saved map context cannot be read, starting with an empty map context.
it: Impossibile leggere i contenuti della mappa salvata, apro una mappa vuota.
pt: Não foi possível ler o mapa de contexto salvo, estamos iniciando com um mapa de contexto vazio.

source: Some layers use temporary data source, are you sure to save this map and loose layers with temporary data sources ?
it: Qualche layer sta usando temporaneamente dei dati sorgente, sei sicuro di voler salvare qusta mappa e perdere questi layer ?
pt: Algumas camadas usam fontes de dados temporárias, você tem certeza de que deseja salvar este mapa e perder as camadas com fontes de dados temporárias?

source: Temporary layers data source
it: Dati sorgente del layer temporanei
pt: Fontes de dados de camadas temporárias

source: Some layers use modified data source, do you want to save also these modifications ?
it: Qualche layer sta modificando dei dati sorgente, vuoi salvare queste modifiche ?
pt: Algumas camadas usam fontes de dados modificadas, você deseja salvar estas modificações também?

source: Save geometry edits
it: Salva le modifiche alla geometria
pt: Salvar edições de geometria

source: Some layers data source modifications can not be saved, are you sure you want to continue ?
it: Qualche modifica non può essere salvata, sei sicuro di voler continuare?
pt: Algumas camadas possuem modificações de fontes de dados que não podem ser salvas, você tem certeza de que deseja continuar?

source: Errors on data source save process
it: Errore durante il salvataggio
pt: Ocorreram erros no processo de salvamento de fontes de dados

source: Unable to load the map context
it: Impossibile caricare i contenuti della mappa
pt: Não foi possível carregar o contexto de mapa

source: MapContext - {0}
it: Contenuti mappa - {0}
pt: Contexto de mapa - {0}

source: Map
it: Mappa
pt: Mapa

source: Map Editor "{0}" [Modified]
it: Editor delle mappe "{0}" [Modificato]
pt: Editor de mapas "{0}" [Modificado]

source: Map Editor "{0}"
it: Editor delle mappe "{0}"
pt: Editor de mapas "{0}"

source: The value of the scale denominator must be equal or greater than 1
it: Il valore del denominatore deve essere maggiore o uguale a 1
pt: O valor do denominador da escala deve ser igual ou superior a 1

source: Fail to load the map context, starting with an empty map context
it: Impossibile caricare i contenuti della mappa salvata, apro una mappa vuota
pt: Ocorreu falha ao carregar o contexto do mapa, estamos iniciando com um contexto de mapa vazio

source: MyMap.ows
pt: MeuMapa.ows

source: Full extent
it: Estensione totale
pt: Extensão completa

source: Zoom to show all geometries
it: Ridimensiona per mostrare tutte le geometrie
pt: Ampliação para mostrar todas as geometrias

source: Clear selection
it: Pulisci selezione
pt: Limpar seleção

source: Clear all selected geometries of all layers
it: Pulisci tutte le geometrie selezionate da tutti i layer
pt: Limpar todas as geometrias selecionadas de todas as camadas

source: Zoom to selection
it: Ingrandisci alla selezione
pt: Ampliação para seleção

source: Zoom to visible selected geometries
it: Ingrandisci alle geometrie selezionate
pt: Ampliação para geometrias selecionadas visíveis

source: Create datasource from selection
it: Crea una sorgente dati dalla selezione
pt: Criar fonte de dados a partir da seleção

source: Mesure tools
it: Strumento di misura
pt: Ferramentas de medição

source: Graphic tools
it: Strumenti grafici
pt: Ferramentas gráficas

source: Maps tree
it: albero delle mappe
pt: Traçados de árvores

source: Show/Hide maps tree
it: Mostra/Nascondi albero delle mappe
pt: Mostrar/ocultar traçados de árvores

source: Export map as image
it: Esporta mappa come un'immagine
pt: Exportar mapa como imagem

source: Export image as file
it: Esporta immagine come un file
pt: Exportar imagem como arquivo

source: Export parameters
it: Esporta parametri
pt: Exportar parâmetros

source: Transparent background
it: Sfondo trasparente
pt: Plano de fundo transparente

source: Width (pixels)
it: Larghezza (pixel)
pt: Largura (pixels)

source: Height (pixels)
it: Altezza (pixel)
pt: Altura (pixels)

source: Keep ratio
pt: Manter proporção

source: Reset extent
pt: Reiniciar extensão

source: Cancel
it: Cancella
pt: Cancelar

source: Save the map as image :
it: Salva la mappa come un'immagine :
pt: Salvar o mapa como imagem :

source: Portable Network Graphics
it: Portable Network Graphics (PNG)
pt: Formato PNG - Portable Network Graphics

source: Portable Document Format
it: Portable Document Format - PDF
pt: Formato PDF - Portable Document Format

source: No layers are selected.
it: Non è stato selezionato nessun layer
pt: Não há camadas selecionadas.

source: Layer {0} has no selected geometries.
it: Il layer {0} non ha geometrie selezionate
pt: A camada {0} não possui geometrias selecionadas.

source: Drawing into file
it: Disegno su un file
pt: Desenhando no arquivo

source: Unable to create and drop the layer
it: Impossibile creare il layer
pt: Não foi possível criar e soltar a camada

source: A problem occurred while opening the DataSource :
it: Si è verificato un'errore all'apertura dei dati sorgente :
pt: Ocorreu um problema ao abrir a fonte de dados :

source: Load the data source droped into the map editor.
it: Carica i dati sorgente nell'editor delle mappe
pt: Carregue a fonte de dados posicionada no editor de mapas.

source: Stop
it: Ferma
pt: Parar

source: Close the drawing toolbar
it: Chiudi la barra di disegno
pt: Fechar a barra de ferramentas de desenho

source: The edited layer has unsaved changes. Do you want to keep theses modifications ?
it: Il layer modificato presenta cambiamenti non salvati. Vuoi mantenere queste modifiche ?
pt: A camada editada possui alterações não salvas. Você deseja manter estas modificações?

source: Save modifications
it: Salva modifiche
pt: Salvar modificações

source: Unable to save the modifications
it: impossibile salvare le modifiche
pt: Não foi possível salvar as modificações

source: Undo
it: Ritorna
pt: Desfazer

source: Undo the last modification
it: Ritorna all'ultima modifica
pt: Desfaz a última alteração

source: Save
it: Salva
pt: Salvar

source: Save unsaved modifications of this layer
it: Salva le modifiche al layer corrente
pt: Salva as alterações não salvas desta camada

source: Delete
it: Elimina
pt: Excluir

source: Delete selected geometries
it: Elimina le geometrie selezionate
pt: Remove as geometrias selecionadas

source: Are you sure to remove the {0} selected geometries ?
it: Sei sicuro di voler eliminare le {0} geometrie selezionate ?
pt: Você tem certeza de que deseja remover as {0} geometrias selecionadas?

source: Cancel all unsaved modifications of this layer
it: Cancella tutte le modifiche non salvate del layer
pt: Cancelar todas as alterações não salvas desta camada

source: Are you sure to cancel all your modifications ?
it: Sei sicuro di voler eliminare tutte le modifiche ?
pt: Você tem certeza de que deseja cancelar todas as modificações feitas?

source: Return to the original state
it: Ritorna allo stato originale
pt: Retorna ao estado original

source: Redo
it: Rifai
pt: Refazer

source: Redo the last modification
it: Rifai l'ultima modifica
pt: Refaz a última modificação

source: Error while drop Editable
it: Errore durante la copia
pt: Ocorreu erro ao arrastar objeto editável

source: The map editor accept only map and geometry data source.
it: L'editor delle mappe accetta solo mappe e geometrie.
pt: Apenas mapas e fonte de dados de geometria são aceitos pelo editor de mapas.

source: Draw a polygon
it: Disegna un poligono
pt: Desenhe um polígono

source: Split polygon
it: Dividi poligono
pt: Dividir polígono

source: Split a polygon by drawing a line
it: Dividi un poligono disegnando una linea
pt: Divida um polígono desenhando uma linha

source: Cannot split the polygon
it: Impossibile dividere il poligono
pt: Não foi possível dividir o polígono

source: Lines must have at least two points
it: Le linee devono avere almeno 2 punti
pt: As linhas devem possuir, ao menos, dois pontos

source: Invalid line
it: Linea non valida
pt: Linha inválida

source: Cannot use wand tool {0}
it: Impossibile usare lo strumento {0}
pt: Não foi possível usar a ferramenta de varinha {0}

source: Cannot apply the legend {0}
it: Impossibile applicare la leggenda {0}
pt: Não foi possível aplicar a legenda {0}

source: Error accessing the GeoRaster {0}
it: Errore durante l'accesso a GeoRaster {0}
pt: Ocorreu erro ao acessar o GeoRaster {0}

source: Error accessing the wand layer datasource {0}
it: Errore durante l'accesso ai sorgenti dati del layer {0}
pt: Ocorreu erro ao acessar a camada de varinha da fonte de dados {0}

source: Error committing the wand layer datasource {0}
it: Errore durante la commissione dei dati sorgente del layer {0}
pt: Ocorreu erro ao usar a camada de varinha da fonte de dados {0}

source: Vectorize a set of pixels
it: Vettorizza un insieme di pixel
pt: Vetorizar um conjunto de pixels

source: Problem to access the GeoRaster
it: Problema di accesso a GeoRaster
pt: Ocorreu problema ao acessar o GeoRaster

source: Problem adding the new layer
it: Problema nell'aggiunta del nuovo layer
pt: Ocorreu problema ao adicionar a nova camada

source: Operation error with the GeoRaster
it: Operazione non valida in GeoRaster
pt: Ocorreu erro de operação com o GeoRaster

source: Cannot create the resulting layer of raster type
it: Impossibile creare il layer risultante
pt: Não foi possível criar a camada resultante de tipo varredura (raster)

source: Compute a watershed
it: Calcola uno spartiacque
pt: Calcular um divisor de águas

source: Cannot Autocomplete the polygon
it: Impossibile autocompletare il poligono
pt: Não foi possível completar automaticamente o polígono

source: Autocomplete a polygon
it: Completa automaticamente il poligono
pt: Complete automaticamente um polígono

source: Cannot split line
it: Impossibile dividere la linea
pt: Não foi possível dividir linha

source: Split line
it: Dividi linea
pt: Dividir linha

source: Split a line by selecting a vertex
it: Dividi una linea selezionando un vertice
pt: Divida uma linha selecionando um vértice

source: Click a selected vertex to remove it
it: Clicca su un vertice selezionato per rimuoverlo
pt: Clique em um vértice selecionado para removê-lo

source: Delete vertex
it: Elimina vertice
pt: Excluir vértice

source: Select the center of the zoom
it: Seleziona il centro dello zoom
pt: Seleccione o centro da ampliação

source: Select the point location
it: Seleziona la locazione del punto
pt: Selecione a localização do ponto

source: Select a geometry or draw a selection rectangle
it: Seleziona una geometria o disegna un rettangolo di selezione
pt: Selecione uma geometria ou desenhe um retângulo de seleção

source: Select the second point
it: Seleziona il secondo punto
pt: Selecione o segundo ponto

source: Click a handler to move it or select another geometry
it: Clicca un oggetto per muoverlo oppure seleziona una nuova geometria
pt: Clique em um manipulador para movê-lo ou selecione outra geometria

source: Place the handler in its new position
it: Sposta l'oggetto nella nuova posizione
pt: Posicione o manipulador em sua nova posição

source: Can't find the status of this tool.
it: Impossibile rilevare lo stato di questo strumento.
pt: Não foi possível localizar o estado desta ferramenta.

source: Select a feature
it: Seleziona una caratteristica
pt: Selecione um recurso

source: Click on an edge to insert a vertex
it: Seleziona un lato per inserire un vertice
pt: Clique em uma borda para inserir o vértice

source: Add a new vertex
it: Aggiungi un nuovo vertice
pt: Adicionar um novo vértice

source: Terminate multipoint
it: Mermina multipunto
pt: Terminar multiponto

source: Select the next point location or terminate multipoint
it: Seleziona la prossima locazione o termina il multipunto
pt: Selecione o próximo local de ponto ou termine o multiponto

source: Draw a multipoint
it: Disegna una multiliea
pt: Desenhe um multiponto

source: Select the first point of the zooming rectangle
it: Seleziona il primo punto del rettangolo di ingrandimento
pt: Selecione o primeiro ponto do retângulo de ampliação

source: Terminate multipolygon
it: Termina multipoligono
pt: Terminar multipolígonos

source: Terminate polygon
it: Termina poligono
pt: Terminar polígono

source: Select the first point/terminate multipolygon
it: Seleziona il primo punto/punto terminale del multipoligono
pt: Selecione o primeiro ponto/termine o multipolígonos

source: Select the next point/terminate polygon/terminate multipolygon
it: Seleziona il prossimo punto oppure termina il poligono o il multipoligono
pt: Selecione o próximo ponto/termine o polígono/termine o multipolígonos

source: Draw a multipolygon
it: Disegna un multipoligono
pt: Desenhar um multipolígono

source: Cancel (transition)
it: Canclella ( transizione)
pt: Cancelar (transição)

source: Terminate line
it: Termina linea
pt: Terminar linha

source: Select the first point
it: Seleziona il primo punto
pt: Selecione o primeiro ponto

source: Select the next point or terminate line
it: Seleziona il prossimo punto o termina la linea
pt: Selecione o próximo ponto ou termine a linha

source: Select the next point or [T]erminate polygon
it: Seleziona il prossimo punto oppure [T]ermina il poligono
pt: Selecione o próximo ponto ou [T]ermine o polígono

source: Select start point
it: Seleziona un punto di partenza
pt: Selecionar ponto de início

source: Drag to destination point
it: Trascina fino al punto di destinazione
pt: Arrastar ao ponto de destino

source: Terminate multiline
it: Termina multilinea
pt: Terminar multilinhas

source: Select the first point terminate multiline
it: Seleziona il primo punto/punto terminale del multipoligono
pt: Selecione o primeiro ponto de encerramento das multilinhas

source: Select the next point terminate line terminate multiline
it: Seleziona il prossimo punto oppure termina la linea o la multilinea
pt: Selecione o próximo ponto de encerramento das multilinhas

source: Draw a multiline
it: Disegna una multilinea
pt: Desenhar uma multilinha

source: Draw multi-polygon
it: Disegna multi.poligono
pt: Desenhar multi-polígono

source: Select a geometry
it: Seleziona una geometria
pt: Selecione uma geometria

source: Split line by line
it: Dividi un linea con un'altra linea
pt: Dividir linha por linha

source: Split a line by drawing a line
it: Dividi una linea disegnando un'altra linea
pt: Dividir uma linha ao desenhar uma linha

source: Cannot split the line
it: Impossibile dividere la linea
pt: Não foi possível dividir a linha

source: Angle : {0}
it: Angolo : {0}
pt: Ângulo : {0}

source: Mesure angle
it: Misura angolo
pt: Ângulo de medição

source: This tool mesure the angle
it: Questo strumento misura gli angoli
pt: Esta ferramenta mede o ângulo

source: Zoom out
it: Rimpicciolisci
pt: Reduzir

source: This tool zoom out on click
it: Questo strumento ingrandisce l'immagine
pt: Esta ferramenta reduz ao clicar

source: Cannot delete vertex
it: Impossibile eliminare il vertice
pt: Não foi possível excluir o vértice

source: Cannot modify the theme
it: Impossibile modificare il tema
pt: Não foi possível modificar o tema

source: Cannot move {0}
it: Impossibile spostare {0}
pt: Não foi possível mover {0}

source: Cannot cut the polygon
it: Impossibile tagliare il coligono
pt: Não foi possível recortar o polígono

source: Cut a polygon
it: Taglia il poligono
pt: Recorte um polígono

source: Select a polygon then draw another polygon to subtract the first one
it: Seleziona un poligono e poi disegna un'altro poligono per sottrarlo al primo
pt: Selecione um polígono, em seguida, desenhe um outro polígono para subtrair o primeiro

source: Coordinate : {0}
pt: Coordenada : {0}

source: Pick a point
it: Seleziona un punto
pt: Escolha um ponto

source: Zoom in
it: Ingrandisci
pt: Ampliar

source: Click on the map to zoom in
it: Clicca sulla mappa per ingrandire
pt: Clique no mapa para ampliar

source: Cannot use fence tool
it: Impossibile usare il strumento recinzione
pt: Não foi possível usar ferramenta de cerca

source: Error while recovering fence vectorial layer
it: Errore durante il ripristino del recinto nel layer vettoriale
pt: Ocorreu erro ao recuperar camada vetorial de cerca

source: Cannot create fence layer
it: Impossibile creare un layer di recinto
pt: Não foi possível criar camada de cerca

source: Draw a fence
it: Disegna un recinto
pt: Desenhar uma cerca

source: Get feature attributes
it: Visualizza attributi recinto
pt: Obter atributos de recursos

source: Area : {0} Perimeter : {1}
it: Area : {0} Perimetro : {1}
pt: Área : {0} Perímetro : {1}

source: Mesure area
it: Misura area
pt: Área de medição

source: This tool mesure the area
it: Questo strumento misura l'area
pt: Esta ferramenta mede a área

source: Invalid multiline
it: Multilinea non valida
pt: Multilinha inválida

source: Cannot update the geometry {0}
it: Impossibile aggiornare la geometria {0}
pt: Não foi possível atualizar a geometria {0}

source: Move vertex
it: Muovi vertice
pt: Mover vértice

source: Pan
it: Trascina
pt: Forma

source: The Pan Tool
it: Strumento trascina
pt: A ferramenta de forma

source: Polygons must have more than two points
it: I poligoni devo avere più di 2 punti
pt: Polígonos devem possuir mais do que dois pontos

source: Invalid polygon
it: Poligono non valido
pt: Polígono inválido

source: Cannot insert linestring
it: Impossibile inserire una stringa
pt: Não foi possível inserir string de linha

source: Draw a line
it: Disegna una linea
pt: Desenhar uma linha

source: Distance : {0}
it: Distanza : {0}
pt: Distância : {0}

source: This tool mesure the length on the map
it: Questo strumento misura la lunghezza sulla mappa
pt: Esta ferramenta mede o comprimento no mapa

source: Mesure length
it: Misura lunghezza
pt: Medir comprimento

source: Draw a point
it: Disegna un punto
pt: Desenhar um ponto

source: Open the map
it: Apri la mappa
pt: Abrir o mapa

source: Remote
it: Remoto
pt: Remoto

source: Cannot load map catalog server {0}
it: Impossibile caricare il server del catalogo mappe {0}
pt: Não foi possível carregar o servidor de catálogos de mapa {0}

source: Enter the server URL
it: Inserisci l'URL del server
pt: Digite o URL do servidor

source: You type an incorrect URL {0}
it: Hai digitato un URL non valido {0}
pt: Você digitou uma URL incorreta {0}

source: Add Map Catalog server
it: Aggiungi server Map Catalog
pt: Adicionar servidor de catálogos de mapa

source: Add a new remote map catalog
it: Aggiungi un nuovo catalogo mappe remoto
pt: Adiciona um novo catálogo remoto de mapas

source: Unlink
it: Scollega
pt: Desvincular

source: Unlink the folder, without deleting it
it: Scollega la cartella senza eliminarla
pt: Desvincula a pasta, sem excluí-la

source: Cannot download the server's workspaces of {0}
it: Impossibile scaricare le aree di lavoro del server {0}
pt: Não foi possível baixar os espaços de trabalho do servidor {0}

source: Download the workspaces of {0}
it: Scarica l'area di lavoro di {0}
pt: Baixe os espaços de trabalho de {0}

source: Cannot download the server's contexts of {0}
it: Impossibile scaricare i contenuti del server {0}
pt: Não foi possível baixar os contextos de {0} do servidor

source: Download the context of {0}
it: Scarica i contenuti di {0}
pt: Baixar o contexto de {0}

source: Uploading the map context..
it: Carico i contenuti delle mappe...
pt: Enviando o contexto do mapa..

source: The map cannot be removed
it: La mappa non può essere rimossa
pt: O mapa não pode ser removido

source: Delete the remote map context
it: Rimuovi i contenuti della mappa
pt: Excluir o contexto do mapa remoto

source: Parse maps title and description
it: Incolla titolo e descrizione delle mappe
pt: Analisar o título e a descrição de mapas

source: Error while downloading the map content
it: Errore durante il download del contenuto della mappa
pt: Ocorreu erro ao baixar o conteúdo do mapa

source: Downloading..
pt: Baixando..

source: Map creation failed
it: Impossibile creare la mappa
pt: Ocorreu falha na criação de mapa
