Repository: orbisgis/orbisgis
Catalog: workspace-gui/src/main/resources/org/orbisgis/wkgui/translation/language/*.po
Languages: it, pt

source: Are you sure you want to delete permanently the selected files ?
it: Sei sicuro di voler eliminare definitivamente i file selezionati?
pt: Você tem certeza de que deseja excluir permanentemente os arquivos selecionados ?

source: Remove the files
it: Rimuovi i file
pt: Remove os arquivos

source: Cannot remove the file
it: Impossibile rimuovere il file
pt: Não foi possível remover o arquivo

source: Cannot remove the file {0}
it: Impossibile rimuovere il file {0}
pt: Não foi possível remover o arquivo {0}

source: Remove permanently the map
it: Rimuovi la mappa in modo definitivo
pt: Remove de forma permanente o mapa

source: Select a folder to link with map manager
it: Seleziona una cartella da collegare alla mappa
pt: Selecione uma pasta a ser vinculada com o gerenciador de mapas

source: Add Map Catalog folder
it: Aggiungi una cartella Map Catalog
pt: Adicionar pasta de catálogos de mapa

source: Add link to a local folder
it: Aggiungi un collegamento alla cartella locale
pt: Adicionar vínculo a uma pasta local

source: Edit the URL
it: Modifica l'URL
pt: Editar a URL

source: Remove this server
it: Rimuovi questo server
pt: Remover este servidor

source: Update
it: Aggiorna
pt: Atualizar

source: Download the server content
it: Scarica i contenuti del server
pt: Baixar o conteúdo do servidor

source: Are you sure you want to replace the remote map context ?
it: Sei sicuro di voler sostituire il contenuto della mappa ?
pt: Você tem certeza de que deseja substituir o contexto do mapa remoto?

source: Overwrite map context confirmation
it: Mappa sovrasctitta
pt: Confirmação de sobrescrita de contexto de mapa

source: Remove this map on the server
it: Rimuovi questa mappa dal server
pt: Remover este mapa no servidor

source: default
it: predefinito
pt: padrão

source: Maps manager
it: Gestore delle mappe
pt: Gerenciador de mapas

source: Enter the Map file name
it: Inserisci il nome del file mappa
pt: Digite o nome de arquivo do mapa

source: MyMap
it: Le mie mappe
pt: MeuMapa

source: The specified file name already exist
it: Il nome specificato è già esistente
pt: O nome de arquivo especificado já existe

source: The map creation has failed
it: Impossibile creare la mappa
pt: A criação do mapa falhou

source: New empty map
it: Nuova mappa vuota
pt: Novo mapa vazio

source: Create a new OWS Map in this folder
it: Crea una nuova mappa OWS in questa cartella
pt: Criar um novo mapa OWS nesta pasta

source: Download the workspace content
it: Scarica i contenuti dell'area di lavoro
pt: Baixar o conteúdo do espaço de trabalho

source: Cannot initialize beanshell
it: Impossibile inizializzare la beanshell
pt: Não foi possível inicializar BeanShell

source: Cannot initialize beanshell script folder
it: Impossibile inizializzare la cartella degli script beanshell
pt: Não foi possível inicializar a pasta de script do BeanShell

source: Do you want to clear the contents of the console?
it: Vuoi pulire il contenuto della console?
pt: Você deseja limpar os conteúdos do console?

source: Clear script
it: Pulisci script
pt: Limpar script

source: Execute
it: Esegui
pt: Executar

source: Execute the java script
it: Esegui script java
pt: Executar script Java

source: Clear
it: Pulisci
pt: Limpar

source: Erase the content of the editor
it: Elimina il contenuto dell'editor
pt: Apagar o conteúdo do editor

source: Open
it: Apri
pt: Abrir

source: Load a file in this editor
it: Carica un file nell'editor
pt: Carregar um arquivo neste editor

source: Save the editor content into a file
it: Salva i contenuti dell'editor in un file
pt: Salvar o conteúdo do editor em um arquivo

source: Search..
it: Cerca..
pt: Pesquisar..

source: Search text in the document
it: Cerca il testo nel documento
pt: Pesquise texto no documento

source: (Un)comment
pt: Fazer (ou desfazer) comentário

source: (Un)comment the selected text
pt: Fazer (ou desfazer) comentário no texto selecionado

source: Block (un)comment
pt: Fazer (ou desfazer) comentário em bloco

source: Block (un)comment the selected text.
pt: Fazer (ou desfazer) comentário em bloco no texto selecionado.

source: Save script
it: Salva script
pt: Salvar script

source: BeanShell Script (*.bsh)
it: Script BeanShell (*.bsh)
pt: Script do BeanShell (*.bsh)

source: IO error.
it: Errore IO.
pt: Erro de entrada e saída.

source: The file has been saved.
it: Il file è stato salvato.
pt: O arquivo foi salvo.

source: Open script
it: Apri script
pt: Abrir script

source: Do you want to clear all before loading the file ?
it: Vuoi pulire tutto prima di caricare il file?
pt: Você deseja apagar tudo antes de carregar o arquivo?

source: Open file
it: Apri file
pt: Abrir arquivo

source: Cannot execute the script
it: Imopossibile eseguire lo script
pt: Não foi possível executar o script

source: The script is not valid
it: Lo script non è valido
pt: O script não é válido

source: Not contains
it: Non contiene
pt: Não contém

source: Alphanumeric
it: Alfanumerico
pt: Alfanumérico

source: DataBase
pt: Base de dados

source: Files
it: File
pt: Arquivos

source: Geometry
it: Geometrico
pt: Geometria

source: Raster
pt: Varredura (raster)

source: Vectorial
it: Vettoriale
pt: Vetorial

source: Web Map Services
it: Servizi Mappe Web
pt: Serviços de mapas na web

source: System Table
it: Tabella di sistema
pt: Tabela do sistema

source: Source type is
it: Il tipo di sorgente è
pt: Tipo da fonte é

source: Contains
it: Contiene
pt: Contém

source: Data source schema could not be read
it: Impossibile leggere i dati sorgente
pt: Não foi possível ler o esquema da fonte de dados

source: GeoCatalog
pt: Catálogo geográfico

source: Add filter
it: Aggiungi filtro
pt: Adicionar filtro

source: Add a new data source filter
it: Aggiungi un nuovo filtro dati
pt: Adicionar um novo filtro de fonte de dados

source: Select the file to add
it: Seleziona il fine da aggiungere
pt: Selecione o arquivo a ser adicionado

source: This source was already registered
it: Il sorgente è già stato registrato
pt: Esta fonte já foi registrada

source: All data source of the GeoCatalog will be removed. Are you sure ?
it: Tutti i dati di GeoCatalog verranno rimossi. Sicuro di voler continuare?
pt: Todas as fontes de dados do catálogo geográfico serão removidas. Você tem certeza disto ?

source: Clear the GeoCatalog
it: Pulisci GeoCatalog
pt: Limpar o catálogo geográfico

source: Cannot remove the source {0}
it: Impossibile rimuove la sorgente {0}
pt: Não foi possível remover a fonte {0}

source: Save the source :
it: Salva la sorgente:
pt: Salvar a fonte :

source: Add files from a folder
it: Aggiungi file dalla cartella
pt: Adicionar arquivos de uma pasta

source: Add from folder
it: Aggiungi dalla cartella
pt: Adicionar de pasta

source: Cannot find a valid image format for this WMS server
it: Impossibile trovare un'immagine valida per questo server WMS
pt: Não foi possível encontrar um formato de imagem válido para este servidor WMS

source: Can't read the given URI:
it: Impossibile leggere l'URI:
pt: Não foi possível ler o URI fornecido:

source: The given URI contains illegal character
it: L'URI immesso contiene caratteri non validi
pt: O URI fornecido possui caractere ilegal

source: The source is already registered :
it: Il sorgente è già stato registrato
pt: A fonte já está registrada :

source: Add
it: Aggiungi
pt: Adicionar

source: File
pt: Arquivo

source: Add a file from hard drive.
it: Aggiungi un file dall'hardi disk.
pt: Adicionar um arquivo do disco rígido.

source: Folder
it: Cartella
pt: Pasta

source: Add a set of file from an hard drive folder.
it: Aggiungi un insieme di file da una cartella.
pt: Adicionar um conjunto de arquivos de uma pasta no disco rígido.

source: Add one or more tables from a DataBase
it: Aggiungi una o più tabelle da un database
pt: Adicionar uma ou mais tabelas de uma base de dados

source: WMS server
it: Server WMS
pt: Servidor WMS

source: Add a WebMapService
it: Aggiungi un servizio mappe web
pt: Adicionar um serviço de mapas na web

source: Save selected sources in files
it: Sarva le sorgenti selezionate in un file
pt: Salvar fontes selecionadas em arquivos

source: Database
pt: Base de dados

source: Save selected sources in a data base
it: Salva le sorgenti selezionate in un database
pt: Salvar fontes selecionadas em uma base de dados

source: Open the attributes
it: Mostra gli attributi
pt: Abrir os atributos

source: Open the data source table
it: Apri una tabella dati sorgente
pt: Abrir a tabela de fonte de dados

source: Remove the source
it: Rimuovi il sorgente
pt: Remover a fonte

source: Remove from this list the selected sources.
it: Rimuovi le risorse selezionate da questa lista.
pt: Remover desta lista as fontes selecionadas.

source: Remove all sources in this list
it: Rimuovi tutte le risorse in questa lista
pt: Remova todas as fontes nesta lista

source: Source {0}
it: Sorgente {0}
pt: Fonte {0}

source: Cannot save the source modifications
it: Impossibile salvare le modifiche alla sorgente
pt: Não foi possível salvar as modificações de fonte

source: Saving the source in a database.
it: Salvo il sorgente nel database
pt: Salvando a fonte em uma base de dados.

source: Save sources in a database
it: Salva sorgenti nel database
pt: Salvar fontes em uma base de dados

source: Close
it: Chiudi
pt: Fechar

source: Please connect to a database
it: Connettiti al database
pt: Por gentileza, conecte-se a uma base de dados

source: At least one row must be checked.
it: Almeno una riga deve essere selezionata
pt: Ao menos uma linha deve ser verificada.

source: Cannot connect to the database.
it: Impossibile connettersi al database
pt: Não foi possível conectar-se ao banco de dados.

source: Please set a password
it: Imposta una password
pt: Por gentileza, defina uma senha

source: Login
it: Accedi
pt: Acesso

source: Password
pt: Senha

source: The login cannot be empty.
it: Il login non può rimanere vuoto.
pt: O acesso não pode ser vazio.

source: The password cannot be empty.
it: La password non può rimanere vuota
pt: A senha não pode ficar em branco.

source: Cannot connect the database
it: Impossibile connettersi al database
pt: Não foi possível conectar-se ao banco de dados

source: Connection parameters
it: Parametri di connessione
pt: Parâmetros da conexão

source: Connexion name
it: Nome connessione
pt: Nome da conexão

source: MyConnexion
it: Le mie connessioni
pt: Minha conexão

source: Type of database
it: Tipo di database
pt: Tipo de banco de dados

source: Host
pt: Servidor

source: Default port
it: Porta predefinita
pt: Porta padrão

source: Database name
it: Nome database
pt: Nome da base de dados

source: Please specify a connexion name
it: Verifica il nome della connessione
pt: Por gentileza, especifique um nome de conexão

source: The database name is mandatory
it: Il nome del database è obbligatorio
pt: O nome da base de dados é obrigatório

source: The host cannot be null
it: L'host non può rimanere vuoto
pt: O campo máquina não pode ficar vazio

source: The port field is mandatory
it: Il campo porta è obbligatorio
pt: O campo porta é obrigatório

source: The port number must lie between 0 and 32767.
it: Il numero di porta deve essere compreso tra 0 e 32767
pt: O número da porta deve estar entre 0 e 32767.

source: Cannot format the port code into an int
it: Impossibile convertire il numero di porta in un intero
pt: Não foi possível formatar o código da porta em um número inteiro

source: The port number must be comprise between 0 and 32767
it: Il numero di porta è compreso tra 0 e 32767
pt: O número da porta deve compreender entre 0 e 32767

source: This table does not exist.
it: Questa tabella non esiste
pt: Esta tabela não existe.

source: The required DataSource could not be created.
it: I dati richiesti non possono essere creti.
pt: Não foi possível criar a fonte de dados solicitada.

source: Open tables or views from a database
it: Apri le tabelle o visualizzale nel database
pt: Tabelas abertas ou visões (views) de um banco de dados

source: Please set the user name and a password
it: Imposta un nome utente ed una password
pt: Por gentileza, defina o nome de usuário e uma senha

source: The database contains any tables or views.
it: Il database non contiene nessuna tabella o vista.
pt: O banco de dados contém todas as tabelas ou visões (views).

source: At least one table or view must be selected.
it: Seleziona almeno una tabella.
pt: Devem ser selecionados ao menos uma tabela ou visão (view).

source: Tables
it: Tabelle
pt: Tabelas

source: Views
it: Visualizza
pt: Visões

source: Cannot list the tables and views
it: Impossibile visualizzare le tabelle e le viste
pt: Não foi possível listar as tabelas e visões (views)

source: Cannot open the connection
it: Impossibile aprire la connessione
pt: Não foi possível abrir a conexão

source: Populating the database list...
it: Genero la lista dei database...
pt: Preenchendo a lista de base de dados...

source: Connect to the database
it: Connetti al database
pt: Conectar-se ao banco de dados

source: Disconnect
it: Disconnetti
pt: Desconectar

source: Add a new connection
it: Aggiungi una nuova connessione
pt: Adicionar nova conexão

source: Edit the connection
it: Modifica la connessione
pt: Editar a conexão

source: Remove the connection
it: Rimuovi la connessione
pt: Remover a conexão

source: Saved with the OrbisGIS database panel
it: Salvato con il pannello del database OrbisGIS
pt: Salvo com o painel de banco de dados do OrbisGIS

source: There is already a connection with this name.
it: Esiste già una connessione con questo nome
pt: Já existe uma conexão com esse mesmo nome.

source: -1 is not allowed . The input code will be used.
it: -1 non è un valore valido.. Verrà utilizzato il codice in input.
pt: Não é permitido usar -1. Será usado o código de entrada.

source: Cannot format the EPSG code into an int. The default code will be used.
it: Impossibile convertire il codice ESPG in un intero. Verrà utilizzato il codice predefinito.
pt: Não foi possível formatar o código EPSG em um número inteiro. Será usado o código padrão.

source: Choose a list of layers
it: Seleziona una lista di layers
pt: Escolha uma lista de camadas

source: At least a layer must be selected
it: Almeno un layer deve essere selezionato
pt: Ao menos uma camada deve ser selecionada

source: WMS server URL
it: URL server WMS
pt: URL do servidor WMS:

source: Connect to the server.
it: Connetti al server.
pt: Conecta ao servidor.

source: Delete the server connection.
it: Elimina la connessione al server
pt: Exclui a conexão com o servidor.

source: Reload the server connection.
it: Ricarica la connessione al server
pt: Recarrega a conexão com o servidor.

source: Cannot update and save the URL list
it: Impossibile aggiornare e salvare la lista URL
pt: Não foi possível atualizar e salvar a lista de URL

source: Information
it: Informazioni
pt: Informações

source: Version :
it: Versione:
pt: Versão :

source: Name :
it: Nome :
pt: Nome :

source: Cannot load the list of WMS url
it: Impossibile caricare la lista degli url WMS
pt: Não foi possível carregar a lista de url WMS

source: Cannot save the list of WMS url
it: Impossibile salvare la lista degli url WMS
pt: Não foi possível salvar a lista de url WMS

source: WMS server connection
it: Connessione al server WMS
pt: Conexão ao servidor WMS

source: Please connect to the WMS server
it: Connettiti ad aun server WMS
pt: Por gentileza, efetue conexão ao servidor WMS

source: Cannot connect to {0}
it: Impossibile connettersi a {0}
pt: Não foi possível conectar-se com {0}

source: Cannot get capabilities of {0}
it: Impossibile ottenere informazioni da {0}
pt: Não foi possível obter recursos de {0}

source: Connecting to the server...
it: Connessione al server...
pt: Conectando ao servidor...

source: Select a SRS
it: Seleziona un SRS
pt: Selecione um SRS

source: Search a SRS :
it: Cerca una SRS :
pt: Selecione um SRS :

source: Please select a SRS.
it: Seleziona un SRS.
pt: Por gentileza, selecione um SRS.

source: Save the source in a file.
it: Salva il sorgente in un file
pt: Salva a fonte em um arquivo.

source: The datasource has been exported and added to the geocatalog with the name
it: I dati sorgente sono stati esportati e aggiunti a geocatalog con il nome
pt: As fontes de dados foram exportadas e adicionadas ao catálogo geográfico de respectivo nome

source: Cannot create the file
it: Impossibile creare il file
pt: Não foi possível criar o arquivo

source: Cannot read the source
it: Impossibile leggere la sorgente
pt: Não foi possível ler a fonte

source: Unable to find appropriate icon for typeCode {0}
it: Impossibile trovare un'icona appropriata per il codice {0}
pt: Não foi possível encontrar um ícone apropriado para código do tipo {0}

source: Error while drawing the Toc tree
it: Errore durante il disegno dell'albero
pt: Ocorreu erro ao desenhar a árvore de sumário

source: Min scale greater than max scale in rule {0}.
it: La sala minima è maggiore di quella massima nella regola {0}.
pt: A escala mínima é maior que a escala máxima na regra {0}.

source: Advanced Style Editor
it: Editor di stili avanzato
pt: Editor avançado de estilos

source: Up
it: Su
pt: Acima

source: Down
it: Giù
pt: Abaixo

source: Rename
it: Rinomina
pt: Renomear

source: Choose a name for your rule
it: Scegli un nome per la regola
pt: Escolha um nome para a sua regra

source: Name of the Rule :
it: Nome della Regola :
pt: Nome da regra :

source: Rule name cannot be null or empty.
it: Il nome della regola non può essere vuoto.
pt: Nome da regra não pode ser nulo ou vazio.

source: Add or select a legend.
it: Aggiungi o seleziona una legenda
pt: Adicionar ou selecionar uma legenda.

source: Simple Style Editor - {0}
it: Editor di stili di base - {0}
pt: Editor de estilos simples - {0}

source: You must create at least one legend
it: Devi creare almeno una legenda
pt: Você deve criar ao menos uma legenda

source: Area Symbolizer
it: Simbolo Area
pt: Simbolizador de área

source: Line Symbolizer
it: Simbolo Linea
pt: Simbolizador de linha

source: Point Symbolizer
it: Simbolo Punto
pt: Simbolizador de ponto

source: Text Symbolizer
it: Simbolo testo
pt: Simbolizador de texto

source: Create a thematic map
pt: Criar um mapa teórico

source: The name shall not be empty.
pt: O nome não pode ser vazio.

source: Name
it: Nome
pt: Nome

source: Value
it: Valore
pt: Valor

source: Preview
it: Anteprima
pt: Visualização

source: Threshold
it: Soglia
pt: Limiar

source: Label
it: Etichetta
pt: Rótulo

source: You must use recognized RecodedLine instances in this panel.
it: Devi usare le istanze conosciute in questo pannello
pt: Você deve usar instâncias RecodedLine reconhecidas neste painel.

source: Rule settings
it: Impostazioni
pt: Configurações de regras

source: Min. scale
it: Scala minima
pt: Escala mín.

source: Current
it: Corrente
pt: Atual

source: Max. scale
it: Scala massima
pt: Escala máx.

source: Min. scale is not a valid number
it: Il valore minimo della scala non è un numero valido
pt: A escala mínima não possui um número válido

source: Max. scale is not a valid number
it: Il valore massimo della scala non è un valore valido
pt: A escala máxima não possui um número válido

source: You must use recognized RecodedArea instances in this panel.
it: Devi usare le istanze riconosciute in questo pannello
pt: Você deve usar instâncias RecodedArea reconhecidas neste painel.

source: Style settings
it: Impostazioni di stile
pt: Configurações de estilo

source: Can't build the analysis with an accurate comparator.
it: Impossibile costruire l'analisi con un comparatore accurato.
pt: Não se pode construir a análise com um comparador preciso.

source: Use the fallback color
it: Usa il colore precedente
pt: Usar a cor alternativa

source: Use a color scheme:
it: Usa uno schema di colori:
pt: Usar um esquema de cores:

source: Create
it: Crea
pt: Criar

source: Unique value classification
it: Valore unico di classificazione
pt: Classificação de valores únicos

source: Retrieving classes
it: Classi di recupero
pt: Recuperando classes

source: The application has ended unexpectedly
it: L'applicazione si è chiusa imrovvisamente
pt: O aplicativo foi encerrado de forma inesperada

source: Continue ?
it: Continuare ?
pt: Continuar ?

source: <html><p>The analysis seems to generate more than
it: <html><p>L'analisi sembrerebbe generare più
pt: <html><p>A análise parece criar mais que

source: different values...</p><p>Are you sure you want to continue ?</p></html>
it: valori differenti...</p><p>Sei sicuro di voler continuare ?</p></html>
pt: valores diferentes...</p><p>Você tem certeza de que deseja continuar? </p></html>

source: Operation in progress...
it: Operazione in progresso...
pt: Operação em progresso...

source: Interval classification
it: Classificazione intervalli
pt: Classificação de intervalo

source: Method
it: Metodo
pt: Método

source: Color scheme:
it: Scema colori:
pt: Esquema de cores:

source: Stroke and fill settings
it: Impostazioni di tratto e riempimento
pt: Configurações de traço e preenchimento

source: Max. size
it: Dimensione massima
pt: Tamanho máximo

source: Min. size
it: Dimensione minima
pt: Tamanho mínimo

source: General settings
it: Impostazioni generali
pt: Configurações gerais

source: Fallback symbol
it: Simbolo di ritorno
pt: Símbolo alternativo

source: Color
it: Colore
pt: Cor

source: Max width
it: Larghezza massima
pt: Largura máxima

source: Min width
it: Larghezza minima
pt: Largura mínima

source: Enable
it: Abilita
pt: Habilitar

source: Remove
it: Rimuovi
pt: Remover

source: Could not validate your input.
it: Impossibile validare il tuo input.
pt: Não foi possível validar sua entrada.

source: Gradient
it: Gradiente
pt: Gradiente

source: to
it: a
pt: para

source: Couldn't find file
it: Impossibile trovare il file
pt: Não foi possível localizar o arquivo

source: Select Legend
it: Seleziona leggenda
pt: Selecione a legenda

source: You must select a legend.
it: Devi selezionare una leggenda.
pt: Você deve selecionar uma legenda.

source: Can't recognize this flavour
it: Impossibile riconoscere questo oggetto
pt: Não foi possível reconhecer este item

source: Problem during the transfer
it: Problema durante il trasferimento
pt: Ocorreu problema durante a transferência

source: Cannot change the layer name
it: impossibile cambiare il nome del layer
pt: Não foi possível alterar o nome da camada

source: Layer:{0} DataSource :({1})
pt: Camada:{0} Fonte de dados :({1})

source: Toc
pt: Sumário

source: Save the Map
it: Salva la mappa
pt: Salvar o mapa

source: Zoom to
it: Ingrandisci
pt: Ampliação para

source: Zoom to the layer bounding box
it: Ingrandisci ai lati del layer
pt: Amplie até a caixa delimitadora de camada

source: Zoom to selected geometries
it: Ingrandisci le geometrie selezionate
pt: Ampliação para geometrias selecionadas

source: Clear the selected geometries
it: Elimina le geometrie selezionate
pt: Limpar as geometrias selecionadas

source: Import style
it: Importa stile
pt: Importar estilo

source: Import a style from a file.
it: Importa stile da un file.
pt: Importa um estilo de um arquivo.

source: Add a new legend.
pt: Adicionar uma nova legenda.

source: Open a spreadsheet view of the attributes.
it: Apri una vista degli attributi.
pt: Abrir os atributos em uma visão de planilha.

source: Start editing
it: Inizia la modifica
pt: Iniciar edição

source: The edit geometry toolbar will update this layer's data source.
it: La barra di modifica delle geometrie aggiornerà i dati sorgenti di questo layer.
pt: A barra de ferramentas de edição de geometria irá atualizar as fontes de dados dessa camada.

source: Stop editing
it: Smetti di modificare
pt: Parar edição
