Repository: orbisgis/orbisgis
Catalog: workspace-gui/src/main/resources/org/orbisgis/wkgui/translation/language/*.po
Languages: it, pt

source: Close the edit geometry toolbar.
it: Chiudi la barra di modifica delle geometrie.
pt: Fechar a barra de ferramentas de edição de geometria.

source: Apply the data source modifications
it: Applica le modifiche
pt: Aplicar as modificações das fonte de dados

source: Cancel modifications
it: Cancella le modifiche
pt: Cancelar modificações

source: Undo all data source modifications
it: Cancella tutte le modifiche
pt: Desfazer todas as modificações da fonte de dados

source: Add layer group
it: Aggiungi un gruppo di layer
pt: Adicionar grupo de camada

source: Add layer group to the map context
it: Aggiungi un gruppo di layer al contenuto della mappa
pt: Adicionar grupo de camadas para o contexto do mapa

source: Remove layer
it: Rimuovi layer
pt: Remover camada

source: Remove the layer from the map context
it: Rimuovi il layer dalla mappa
pt: Remove a camada do contexto do mapa

source: Add a legend in this style
pt: Adicionar uma legenda neste estilo.

source: Simple style editor
it: Editor di stili di base
pt: Editor de estilo simples

source: Open the simple editor for SE styles
it: Apri un editor di stili SE di base
pt: Abrir o editor simples para estilos SE

source: Advanced style editor
it: Editor di stili avanzato
pt: Editor de estilo avançado

source: Open the advanced editor for SE styles
it: Apri un editor di stili SE avanzato
pt: Abrir o editor avançado para estilos SE

source: Remove style
it: Rimuovi stile
pt: Remover estilo

source: Remove this style from the associated layer.
it: Rimuovi questo stile dal layer associato
pt: Remover este estilo da camada associada.

source: Export style
it: Esporta stile
pt: Exportar estilo

source: Export this style from the associated layer.
it: Esporta questo stile dal layer associato.
pt: Exportar este estilo da camada associada.

source: Cannot drop layer on {0}
it: Impossibile trascinare il layer su {0}
pt: Não foi possível descartar camada em {0}

source: Drop unknown editable of type : {0}
it: Tipo modificabile sconosciuto : {0}
pt: Objeto desconhecido editável do tipo: {0}

source: Can not add a LayerCollection : {0}
it: Impossibile aggiungere una collezione di layer : {0}
pt: Não foi possível adicionar uma coleção de camadas: {0}

source: Some layers use modified data source, do you want to save these modifications before removing them ?
it: Qualche layer sta modificando dei dati sorgente, vuoi salvare queste modifiche prima di rimuoverli?
pt: Algumas camadas usam fontes de dados modificadas, você deseja salvar essas modificações antes de removê-las?

source: The layer data source {0} can not be saved, are you sure you want to continue ?
it: La modifica al layer {0} non può essere salvata, sei sicuro di voler continuare?
pt: Não foi possível salvar a fonte de dados da camada {0}, você tem certeza de que deseja continuar?

source: Cannot delete layer
it: Impossibile eliminare il layer
pt: Não foi possível excluir a camada

source: This functionality is not supported.
pt: Não há suporte a esta funcionalidade.

source: Advanced Editor can't be loaded
it: L'editor non può essere caricato
pt: Não foi possível carregar o editor avançado

source: Error while editing the legend
it: Errore durante la modifica della leggenda
pt: Ocorreu erro ao editar a legenda

source: You produced an invalid style while copying a valid one. Things are getting really wrong here.
it: Hai prodotto uno stile non valido durante la copia. Gli oggetti sembrano proprio sbagliati qui.
pt: Você produziu um estilo inválido ao copiar um válido. As coisas estão ficando muito erradas aqui.

source: Styles can be set only on vector layers.
pt: Os estilos só podem ser definidos em camadas de vetores.

source: The style you're trying to edit is not valid !
pt: O estilo que você está tentando editar não é válido!

source: An error occurred while processing the DataSource
pt: Ocorreu um erro ao processar a fonte de dados

source: Cannot create the user interface for this style. Please uses the advanced style editor.
pt: Não foi possível criar a interface gráfica para este estilo. Por gentileza, use o editor avançado de estilos.

source: Link the editable element with the Toc
pt: Vincula o elemento editável com o sumário

source: Cannot add the layer to the destination
it: Impossibile aggiungere il layer alla destinazione
pt: Não foi possível adicionar a camada ao destino

source: Load the data source droped into the toc.
it: Carico i dati dorgenti nel toc.
pt: Carregar a fonte de dados posicionada no sumário.

source: Running jobs
it: Processi in esecuzione
pt: Trabalhos em execução

source: Running jobs ({0})
it: Processi in esecuzione ({0})
pt: Trabalhos em execução ({0})

source: Executing script
it: Eseguo lo script
pt: Executando script

source: Cannot parse script
it: Impossibile incollare lo script
pt: Não foi possível analisar script

source: Failed to parse the script.
it: Impossibile incollare lo script.
pt: Ocorreu falha ao analisar script

source: Running instruction {0}/{1} :
it: Eseguo l'istruzione {0}/{1} :
pt: Executando instrução {0}/{1} :

source: Impossible to create the layer:{0}
it: Impossibile creare il layer:{0}
pt: Não foi possível criar a camada:{0}

source: Cannot create the DataSource:{0}
it: Impossibile creare i dati sorgente:{0}
pt: Não foi possível criar a fonte de dados:{0}

source: Data access error:
it: Errore nell'accesso ai dati:
pt: Ocorreu erro de acesso de dados:

source: SQL Semantic Error
it: Errore di semantica SQL
pt: Ocorreu erro de semântica de SQL

source: Execution time: {0}
it: Tempo di esecuzione: {0}
pt: Tempo de execução: {0}

source: Handles all Metadata-related caching for the SQLLanguageSupport class
it: Gestisci la cache per le classi supportate dal linguaggio SQL
pt: Manipula todo o cache relacionado a metadados para a classe SQLLanguageSupport

source: Run SQL statements
it: Esegui codice SQL
pt: Executar expressões SQL

source: Quote
it: Quota
pt: Citar

source: Quote selected text
it: Quota il testo selezionato
pt: Citar texto selecionado

source: Un Quote
it: Elimina Quota
pt: Retirar aspas

source: Un Quote selected text
it: Elimina quota sul testo selezionato
pt: Retira as aspas do texto selecionado

source: Format
it: Formato
pt: Formato

source: Format editor content
it: Formato contenuti editor
pt: Formata o conteúdo do editor

source: SQL list
it: Lista SQL
pt: Lista SQL

source: Show/Hide SQL function list
it: Mostra/Nascondi lista delle funzioni SQL
pt: Mostrar/Ocultar lista de funções SQL

source: SQL script (*.sql)
it: script SQL (*.sql)
pt: Script do SQL (*.sql)

source: Functions count = {0}
it: Conta funzioni = {0}
pt: Contagem de funções = {0}

source: SQL Console
it: Console SQL
pt: Console de SQL

source: Reformat failed, normalised strings differ
it: Riformattazione fallita
pt: Reformatar falhou, as strings normalizadas diferem

source: Add a row
it: Aggiungi una riga
pt: Adicionar linha

source: New row
it: Nuova riga
pt: Nova linha

source: Table "{0}"
it: Tabella "{0}"
pt: Tabela "{0}"

source: Find
it: Trova
pt: Localizar

source: All
it: Tutto
pt: Todos

source: Match case
it: Parole esatte
pt: Diferenciando maiúsculas de minúsculas

source: Whole words
it: Parole intere
pt: Somente palavras inteiras

source: Search
it: Cerca
pt: Pesquisar

source: Filter driver error
it: Filtra errori driver
pt: Erro do driver de filtro

source: Run SQL request
it: Esegui richiesta SQL
pt: Executar solicitação SQL

source: Selecting rows
it: Seleziono le righe
pt: Selecionando linhas

source: Computation of the optimal column width
it: Calcolo la larghezza ottimale della colonna
pt: Cálculo da largura de coluna ideal

source: Table {0}, statistics of the column {1}.
it: Tabella {0}, statistiche della colonna {1}.
pt: Tabela {0}, estatísticas da coluna {1}.

source: Row count : {0}
it: Contatore colonne : {0}
pt: Contagem de linhas : {0}

source: Minimum : {0}
it: Minimo : {0}
pt: Mínimo : {0}

source: Maximum : {0}
it: Massimo : {0}
pt: Máximo : {0}

source: Sum : {0}
it: Somma : {0}
pt: Soma : {0}

source: Average : {0}
it: Media : {0}
pt: Média : {0}

source: Standard deviation : {0}
it: Deviazione standard : {0}
pt: Desvio padrão : {0}

source: Compute column statistics.
it: Calcola le statistiche della colonna.
pt: Calcular estatísticas de coluna.

source: Driver error
it: Errore nel driver
pt: Ocorreu erro de driver

source: Aborted by user
it: Interrotto dall'utente
pt: Interrompido pelo usuário

source: Cache table values
it: Valori tebella di cache
pt: Valores de cache da tabela

source: Sorting {0}
it: Ordino {0}
pt: Ordenando {0}

source: Unable to establish the selection bounding box
it: Impossibile stabilire i bordi del box di selezione
pt: Não foi possível estabelecer a caixa delimitadora da seleção

source: Remove a column
it: Rimuovi una colonna
pt: Remover uma coluna

source: Are you sure you want to remove the column {0} ?
it: Sei sicuro di voler rimuovere la colonna {0} ?
pt: Você tem certeza de que deseja remover a coluna {0} ?

source: Deletion of a column
it: Elimino la colonna
pt: Exclusão de uma coluna

source: Add a column
it: Aggiungi una colonna
pt: Adicionar uma coluna

source: This data source ({0}) is already shown in an editor.
it: I dati sorgente ({0}) sono già aperti nell'editor.
pt: Esta fonte de dados ({0}) já é mostrada em um editor.

source: In a consequence of an unreachable data source {0},the associated data editor could not be recovered.
it: A causa di dati sorgente {0} non raggiungibili, i dati associati all'editor non possono essere ripristinati.
pt: Em conseqüência de uma fonte de dados inacessível {0}, não foi possível recuperar o editor de dados associado.

source: Delete selected rows
it: Elimina le righe selezionate
pt: Excluir linhas selecionadas

source: Are you sure to remove the {0} selected rows ?
it: Sei sicuro di voler eliminare le {0} righe selezionate?
pt: Você tem certeza de que deseja remover as {0} linhas selecionadas?

source: This table use modified data source, do you want to save these modifications before closing it ?
it: Questa tabella utilizza dati modificati, vuoi salvare queste modifiche prima di chiudere la tabella ?
pt: Esta tabela usa fonte de dados modificada, você deseja salvar estas alterações antes de fechá-la?

source: Unsaved modifications
it: Modifiche non salvate
pt: Modificações não salvas

source: The data source {0} can not be saved, are you sure you want to continue ?
it: I dati sorgente {0} non possono essere salvati, vuoi continuare ?
pt: Não foi possível salvar a fonte de dados {0}, você tem certeza de que deseja continuar?

source: Canceled by user
it: Cancellato dall'utente
pt: Cancelado pelo usuário

source: Searching request is already launched. Please wait a moment, or cancel it.
it: La rierca è già partita. Aspetta che finisca oppure cancellala.
pt: O pedido de pesquisa já está sendo executado. Tenha a bondade de esperar um momento ou cancele-o.

source: Filter selected rows
it: Filtra righe selezionate
pt: Filtrar linhas selecionadas

source: Show only the selected rows
it: Mostra solo righe selezionate
pt: Mostrar apenas as linhas selecionadas

source: Clear row filter
it: Elimina filtro righe
pt: Limpar filtro de linha

source: Show all rows
it: Mostra tutte le righe
pt: Mostrar todas as linhas

source: Deselect all lines
it: Elimina tutte le righe
pt: Desmarcar todas as linhas

source: Reverse selection
it: Inverti selezione
pt: Inverter seleção

source: Reverse the current selection
it: Inverti la sevezione corrente
pt: Inverte a seleção atual

source: In the map editor, zoom to the selected rows
it: Sulla mappa, ingrandisci le righe selezionate
pt: No editor de mapas, amplie até as linhas selecionadas

source: Select same cell
it: Seleziona la stessa cella
pt: Selecionar a mesma célula

source: Select all rows that match this cell value
it: Seleziona tutte le righe che corrispondono al valore di questa cella
pt: Selecione todas as linhas que coincidem com este valor de célula

source: Optimal width
it: Ottimizza larghezza
pt: Largura ideal

source: Sort ascending
it: Ordina in modo crescente
pt: Ordem crescente

source: Sort descending
it: Ordina in modo decrescente
pt: Ordem decrescente

source: No sort
it: Non ordinare
pt: Nenhuma ordenação

source: Show column informations
it: Mostra informazioni colonna
pt: Mostrar informações das colunas

source: Show column statistics
it: Mostra statistiche colonna
pt: Mostrar estatísticas de colunas

source: Show column selection statistics
it: Mostra statistiche delle colonne selezionate
pt: Mostrar estatísticas de colunas selecionadas

source: Show filtered column statistics
it: Mostra statistiche delle colonne filtrate
pt: Mostrar estatísticas de colunas filtradas

source: Field name : {0}
it: Nome campo : {0}
pt: Nome do campo : {0}

source: Field type : {0}
it: Tipo campo : {0}
pt: Tipo do campo : {0}

source: Constraints :
it: Vincoli :
pt: Restrições :

source: Table Editor of {0} {1}/{2}
it: Editor delle tabelle di {0} {1}/{2}
pt: Editor de tabela para {0} {1}/{2}

source: Table Editor of {0} (Filtered) {1}/{2}
it: Editor delle tabelle di {0} (Filtrato) {1}/{2}
pt: Editor de tabela para {0} (Filtrado) {1}/{2}

source: Error while loading the table editor
it: Errore durante il caricamento dell'editor delle tabelle
pt: Ocorreu erro ao carregar o editor de tabela

source: Open the data source {0}
it: Apri i dati sorgente {0}
pt: Abrir a fonte de dados {0}

source: Selection deserialisation failed
it: Deserializzazione fallita
pt: Ocorreu falha em tornar a seleção não serializada

source: Selection serialisation failed
it: Serializzazione fallita
pt: Ocorreu falha em tornar a seleção serializada

source: The TableEditor cannot listen to source modifications
it: L'editor di tabelle non può rilevare modifiche alla sorgente
pt: O editor de tabelas não pode escutar modificações de fonte

source: Cannot parse number
it: Impossibile convertire il numero
pt: Não foi possível analisar número

source: &Copy
it: &Copia
pt: &Copiar

source: Clea&r
it: Pulisc&i
pt: Limpa&r

source: Cannot show the log message
it: Impossibile mostrare il messaggio
pt: Não foi possível mostrar a mensagem de registro

source: Output
pt: Saída

source: Clear all
it: Elimina tutto
pt: Limpar tudo

source: Clear all log panels
it: Elimina tutti i pannelli di log
pt: Limpar todos os paineis de registro

source: Errors
it: Errori
pt: Erros

source: Infos
it: Informazioni
pt: Informações

source: Warnings
it: Pericoli
pt: Avisos

source: Debug
pt: Depurar

source: Switch to another workspace
it: Cambia area di lavoro
pt: Alternar para outro espaço de trabalho

source: OrbisGIS version {0} {1} {2}
it: OrbisGIS versione {0} {1} {2}
pt: OrbisGIS versão {0} {1} {2}

source: &File
pt: &Arquivo

source: &Exit
it: &Esci
pt: &Sair

source: &Tools
it: &Strumenti
pt: Ferra&mentas

source: &Configuration
it: &Configurazione
pt: &Configuração

source: Loading GDMS..
it: Carico GDMS..
pt: Carregando GDMS..

source: Contains view folders path
it: Contiene il percorso della cartella
pt: Contém a visão do caminho das pastas

source: Register GUI Sql functions..
it: Registro grafico delle funzioni SQL
pt: Carregar funções SQL relacionadas a interface gráfica..

source: Load the plugin framework..
it: Carico il plugin framework..
pt: Carregar framework do plug-in..

source: Loading of plugins is aborted
it: Il caricamento del plugin è stato sospeso
pt: O carregamento de plug-ins foi interrompido

source: &Save
it: &Salva
pt: &Salvar

source: Save the workspace
pt: Salva o espaço de trabalho

source: Error while loading dialogs informations.
it: Errore durante il caricamento delle informazioni.
pt: Ocorreu erro ao carregar informações das caixas de diálogo.

source: Execute tasks in background processes, showing progress bars. Gives access to the job queue
it: Esegui le operazioni in background, mostrando le barre del progresso. Avrai accesso alla coda dei processi
pt: Executar tarefas em segundo plano, mostrando as barras de progresso. Proporcionar acesso à fila de trabalho

source: Use this instance to open an editable element (map,data source..)
it: Usa questa opzione per aprire un elemento modificabile (mappa, sorgente dati..)
pt: Use esta instância para abrir um elemento editável (mapa, fonte de dados..)

source: Loading the main window
it: Carico la finestra principale
pt: Carregando a janela principal

source: Loading docking system and frames
it: Carico il sistema
pt: Carregando quadros e sistema de encaixe

source: Restore the former layout..
it: Ripristina il layout precedente..
pt: Restaurar a disposição antiga..

source: Unable to save the docking layout.
it: Impossibile salvare il layout.
pt: Não foi possível salvar a disposição de encaixe.

source: Error while saving dialogs informations.
it: Errore durante il salvataggio delle informazioni.
pt: Ocorreu erro ao salvar informações das caixas de diálogo.

source: The workspace has been saved.
pt: O espaço de trabalho foi salvo.

source: The workspace hasn't been saved.
pt: O espaço de trabalho não foi salvo.

source: OrbisGIS needs at least a java 1.7+
pt: OrbisGIS precisa ao menos do java versão 1.7+

source: Use Proxy
it: Utilizza Proxy
pt: Usar proxy

source: Proxy url
it: Url Proxy
pt: URL do proxy

source: Proxy port
it: Porta Proxy
pt: Porta do Proxy:

source: The proxy port is invalid
it: La porta per il server Proxy non è valida
pt: A porta do proxy é inválida

source: Windows
it: Finestre
pt: Janelas

source: Web configuration
it: Configurazione web
pt: Configuração web

source: &Look And Feel
it: &Impostazioni Grafiche
pt: A&parência

source: &Windows
it: &Finestre
pt: &Janelas

source: Unable to load the docking layout.
it: Impossibile caricare il layout.
pt: Não foi possível carregar a disposição de encaixe.

source: ToolBar item {0} is not unique, it has been renamed to {1}
it: L'oggetto {0} non è unico, deve essere rinominato in {1}
pt: O item {0} da barra de ferramentas não é único, ele foi renomeado para {1}

source: Choose the workspace folder
it: Scegli la cartella per l'area di lavoro
pt: Escolha a pasta do espaço de trabalho

source: Choose a previous OrbisGIS workspace or create a new one
it: Scegli un'area di lavoro OrbisGIS precedente oppure creane una nuova
pt: Escolha um espaço de trabalho OrbisGIS anterior ou crie um novo

source: Set as default?
it: Impostare come predefinita?
pt: Definir como padrão?

source: Setting this workspace as default will allow you to skip this dialog next time
pt: Definir este espaço de trabalho como padrão permitirá que você ignore esta caixa de diálogo da próxima vez

source: Workspace Manager
it: Gestore aree di lavoro
pt: Gerenciador de espaços de trabalho

source: Problem updating the workspace.
it: Problema durante l'aggiornamento del workspace.
pt: Ocorreu problema ao atualizar o espaço de trabalho.

source: The workspace folder version is invalid (!=OrbisGIS {0}), or the folder is not empty
it: La versione dell'area di lavoro non è valida (!=OrbisGIS {0}), oppure la cartella non è vuota
pt: A versão da pasta de espaço de trabalho é inválida (!=OrbisGIS {0}), ou a pasta não está vazia

source: Save documents
it: Salva documenti
pt: Salvar documentos

source: Save the selected documents, and close this dialog if there is no more modifed documents
it: Salva i documenti selezionati, e chiudi questa finestra se non ci sono altri documenti da modificare
pt: Salvar os documentos selecionados, e fechar esta caixa de diálogo caso não existam mais documentos modificados

source: Save &All
it: Salva &Tutto
pt: Salvar &todos

source: Save all documents and close this dialog
it: Salva tutti i documenti e chiudi questa scheda
pt: Salve todos os documentos e feche esta caixa de diálogo

source: Save &None
it: Non &Salvare
pt: Salvar &nenhum

source: Discard all changes and close this dialog
it: Elimina tutte le modifiche e chiudi questa scheda
pt: Descarte todas as alterações e feche esta caixa de diálogo

source: &Cancel
it: &Cancella
pt: &Cancelar

source: Do nothing and lose nothing
it: Torna al lavoro
pt: Não faça nada e não perca nada

source: The document {0} cannot be saved due to the following error {1}
it: Il documento {0} non può essere salvato a causa del seguente errore {1}
pt: Não foi possível salvar o documento {0} devido ao seguinte erro {1}

source: The URL is not valid.
it: Questo URL non è valido.
pt: A URL não é válida.

source: The workspace doesn't exist. Please contact the administrator of the service.
it: L'area di lavoro non esiste. Contattare l'amministratore del servizio.
pt: O espaço de trabalho não existe. Por gentileza, entre em contato com o administrador do serviço.

source: The URL is not valid or the service not available.
it: L'URL non è valido oppure il servizio non è raggiungibile.
pt: A URL não é válida ou o serviço não está disponível.

source: A function to share the current mapcontext in the mapcatalog service The second permits to set the workspace name. If the workspace doesn't exist a message appears.
it: Una funzione per condividere il contenuto della mappa corrente all'interno del catalogo mappe La seconda permette di impostare il nome dell'area di lavoro. Se l'area di lavoro non esiste verrà visualizzato un messaggio
pt: Uma função para compartilhar o contexto de mapa atual no serviço de catálogo de mapas. O segundo permite definir o nome do espaço de trabalho. Caso o espaço de trabalho não exista, uma mensagem aparecerá.

source: Return the current mapcontext bounding box as a geometry
it: Ritorna il contenuto della mappa corrente come una geometria
pt: Retornar a caixa delimitadora do contexto de mapa atual como uma geometria

source: Cannot import the style
it: Impossibile importare lo stile
pt: Não foi possível importar o estilo

source: Cannot add the layer to the mapcontext
it: Impossibile aggiungere il layer al contenuto della mappa
pt: Não foi possível adicionar a camada ao contexto de mapa

source: A function to add a layer based on a table name The second argument is optional. It permits to set a style to the layer.
it: Una funzione per aggiungere un layer basata sulla tabella dei nomi Il secondo argomento è opzionale. Permette di impostare uno stile al layer.
pt: Uma função para adicionar uma camada baseando-se no nome de uma tabela. O segundo argumento é opcional. Ele permite definir um estilo para a camada.

source: Cannot compute the full extent
it: Impossibile computare l'estensione totale
pt: Não foi possível calcular a extensão total

source: Zoom to according a dataset
it: Ingrandisci il set di dati
pt: Amplie de acordo com um conjunto de dados

source: Problem when checking for an unbroken range of comments
pt: Ocorreu um problema ao verificar uma faixa intacta de comentários

source: Assuming the selection is not already block commented.
pt: Considera-se que a seleção não recebeu comentário em bloco ainda.

source: Invalid length or offset when trying to uncomment code.
pt: Ocorreu erro ao tentar retirar o comentário do código: comprimento ou deslocamento inválidos.

source: Constraints
it: Vincoli
pt: Restrições

source: Changing the type will remove all constraints. Do you want to continue?
it: Cambiando il tipo verranno rimossi tutti i vincoli. Vuoi continuare?
pt: Ao alterar o tipo, todas as restrições serão removidas. Você deseja continuar?

source: Continue?
it: Continuare?
pt: Continuar?

source: Type
it: Tipo
pt: Tipo

source: Enter the {0} constraint parameter
it: Inserisci il parametro del vincolo {0}
pt: Digite o parâmetro da restrição {0}

source: Raster not supported
it: Il raster non è supportato
pt: Não há suporte à varredura (raster)

source: Select the constraint
it: Seleziona un vincolo
pt: Selecione a restrição

source: Edit
it: Modifica
pt: Editar
