Repository: orbisgis/orbisgis
Catalog: workspace-gui/src/main/resources/org/orbisgis/wkgui/translation/language/*.po
Languages: it, pt

source: The entered value cannot be parsed
it: Impossibile leggere il valore immesso
pt: Não foi possível analisar o valor inserido

source: Cannot list the directory content
it: Impossibile visualizzare i contenuti della cartella
pt: Não foi possível listar o conteúdo do diretório

source: Cannot remove the folder {0}
it: Impossibile eliminare la cartella {0}
pt: Não foi possível remover a pasta {0}

source: The path {0} has been copied to the clipboard
it: Il percorso {0} è stato copiato sulla lavagna
pt: O caminho {0} foi copiado para a área de transferência

source: Could not copy the folder path to the clipboard
it: Impossibile copiare il percorso della cartella sulla lavagna
pt: Não foi possível copiar o caminho da pasta para a área de transferência

source: Copy the path
it: Copia il percorso
pt: Copiar o caminho

source: Copy the folder path in the clipboard
it: Copia il percorso della cartella sulla lavagna
pt: Copia o caminho da pasta para a área de transferência

source: Update the content of this folder from the file system
it: Aggiorna i contenuti di questa cartella dal file system
pt: Atualizar o conteúdo desta pasta a partir do sistema de arquivos

source: New folder
it: Nuova cartella
pt: Nova pasta

source: Create a sub-folder
it: Crea una sottocartella
pt: Criar uma subpasta

source: Remove permanently the folder
it: Rimuovi la cartella in modo definitivo
pt: Remover permanentemente a pasta

source: Enter the folder name
it: Inserisci il nome della cartella
pt: Digite o nome da pasta

source: The folder creation has failed
it: Impossibile creare la cartella
pt: Ocorreu falha na criação de pasta

source: Destination file {0} already exists, cannot move {1}
it: Il file {0} esiste già, impossibile spostare {1}
pt: O arquivo de destino {0} já existe, não pode ser movido {1}

source: Drop the content in the folder..
it: Copia il contenuto nella cartella..
pt: Solte o conteúdo na pasta..

source: Search replace
it: Cerca e rimpiazza
pt: Pesquisar e substituir

source: Text not found !
it: Testo non trovato!
pt: Texto não encontrado !

source: &Find
it: &Trova
pt: &Localizar

source: &Replace
it: &Sostituisci
pt: Substitui&r

source: Replace &All
it: Sostituisci &Tutto
pt: Substituir t&odas

source: &Close
it: &Chiusdi
pt: &Fechar

source: &Match Case
it: &Parole esatte
pt: &Diferenciar maiúsculas/minúsculas

source: &Whole Words
it: &Parole intere
pt: &Somente palavras inteiras

source: Regular E&xpressions
it: E&spressioni regolari
pt: E&xpressão regular

source: M&ark all
it: S&egna tutto
pt: Selecionar &tudo

source: Search &up
it: Cerca in &su
pt: Pesquisar &acima

source: Search &down
it: Cerca in &giù
pt: Pesquisar a&baixo

source: Find what:
it: Cerca:
pt: Localizar:

source: Replace with:
it: Sostituisci con:
pt: Substituir por:

source: The provided filter factory name has not been registered
it: Il filtro fornito non è stato registrato
pt: Não foi registrado o nome do filtro de construção fornecido

source: Delete this filter
it: Elimina questo filtro
pt: Excluir este filtro

source: Add a new filter
it: Aggiungi nuovo filtro
pt: Adicionar um novo filtro

source: Tagged Image File Format
it: Tagged Image File Format (TIFF)

source: Joint Photographic Experts Group
it: Joint Photographic Experts Group - JPEG

source: Local
it: Locale

source: Classes
it: Classi
