Repository: orbisgis/orbisgis
Catalog: bundles/table-editor/src/main/resources/org/orbisgis/tablegui/translation/language/*.po
Languages: fr

source: This data source ({0}) is already shown in an editor.
fr: Cette source de donnée ({0}) est déjà affichée dans un éditeur.

source: Selection deserialisation failed
fr: La désérialisation de la sélection a échoué

source: Selection serialisation failed
fr: La sérialisation de la sélection a échoué

source: Stop editing
fr: Arrêter l'édition

source: Start editing
fr: Démarrer l'édition

source: Open the attributes
fr: Ouvrir les attributs

source: Searching request is already launched. Please wait a moment, or cancel it.
fr: Le demande de recherche est déjà en cours. Veuillez patienter ou bien annulez-la.

source: filter selected rows
fr: Filtrer les lignes sélectionnées

source: Show only the selected rows
fr: Afficher uniquement les lignes sélectionnées

source: Clear row filter
fr: Effacer le filtre de ligne

source: Show all rows
fr: Afficher toutes les lignes

source: Create datasource from selection
fr: Créer une source de donnée à partir de la sélection

source: Create a datasource from the current selection
fr: Créer une source de donnée à partir de la sélection courante

source: Clear selection
fr: Déselectionner

source: Deselect all lines
fr: Désélectionner toutes les lignes

source: Zoom to selection
fr: Zoomer sur la sélection

source: In the map editor, zoom to the selected rows
fr: Dans la carte, zoomer vers les lignes sélectionnées

source: Reverse selection
fr: Inverser la sélection

source: Reverse the current selection
fr: Inverser la sélection courante

source: Select same cell
fr: Sélectionner les mêmes cellules

source: Select all rows that match this cell value
fr: Sélectionner les lignes avec la même valeur

source: Optimal width
fr: Largeur optimale

source: Sort ascending
fr: Tri croissant

source: Sort descending
fr: Tri décroissant

source: No sort
fr: Pas de tri

source: Show column statistics
fr: Afficher les statistiques

source: Show column selection statistics
fr: Afficher les statistiques de la sélection

source: Show filtered column statistics
fr: Afficher les statistiques des colonnes filtrées

source: Table Editor of {0} (Filtered) {1}/{2}
fr: {0} - (Filtré) {1}/{2}

source: Error while loading the table editor
fr: Erreur lors du chargement de la table

source: Open a spreadsheet view of the attributes.
fr: Ouvrir la table attributaire.

source: Selecting rows
fr: Sélection de lignes

source: Computation of the optimal column width
fr: Détermination de largeur optimale de colonne

source: Compute column statistics.
fr: Calculer les statistiques de la colonne

source: Table {0}, statistics of the column {1}.
fr: Table : {0} - Statistiques de la colonne : {1}.

source: Row count : {0}
fr: Nombre de ligne : {0}

source: Sum : {0}
fr: Somme : {0}

source: Average : {0}
fr: Moyenne : {0}

source: Standard deviation : {0}
fr: Écart-type : {0}

source: Sorting {0}
fr: Tri {0}

source: Find
fr: Trouver

source: All
fr: Tout

source: Match case
fr: Respecter la casse

source: Whole words
fr: Mots entiers

source: Search
fr: Rechercher
