Repository: orbisgis/orbisgis
Catalog: bundles/core-map/src/main/resources/org/orbisgis/coremap/*.po
Languages: pt

source: Layer {0} not drawn
pt: Camada {0} não desenhada

source: Cannot get Stream image
pt: Não foi possível obter a imagem de fluxo

source: Area Symbolizer
pt: Simbolizador de área

source: Dash array must be made of positive numbers separated with spaces.
pt: O vetor de traços deve ser constituído de números positivos separados por espaços.

source: Line Symbolizer
pt: Simbolizador de linha

source: Point Symbolizer
pt: Simbolizador de ponto

source: Could not find position for mark within area
pt: Não foi possível localizar posição para marcação dentro desta área

source: Fallback
pt: Resguardar

source: Natural breaks
pt: Interrupções naturais

source: Quantiles
pt: Quantis

source: Equal Intervals
pt: Intervalos iguais

source: Mean - Standard deviation
pt: Média - Desvio padrão

source: Boxed means
pt: Em caixas ("Boxed means")

source: Unable to categorize the feature
pt: Não foi possível categorizar o recurso

source: Fallback ({0})
pt: Resguardar ({0})

source: Error during graphic composition
pt: Ocorreu erro durante a composição gráfica

source: Could not render graphic
pt: Não foi possível renderizar os gráficos

source: SQUARE
pt: QUADRADO

source: HALFCIRCLE
pt: MEIO-CÍRCULO

source: TRIANGLE
pt: TRIÂNGULO

source: STAR
pt: ESTRELA

source: CROSS
pt: CRUZ

source: CIRCLE
pt: CÍRCULO

source: Perpendicular offset failed
pt: Ocorreu falha no deslocamento perpendicular

source: CLOSE
pt: FECHAR

source: CUBIC TO {0}:{1}
pt: CÚBICO PARA {0}:{1}

source: LINE TO {0}:{1}
pt: LINHA PARA {0}:{1}

source: MOVE TO {0}:{1}
pt: MOVER PARA {0}:{1}

source: QUAD TO {0}:{1}
pt: QUAD PARA {0}:{1}

source: !DEFAULT!
pt: !PADRÃO!

source: Unable to compute perpendicular offset
pt: Não foi possível calcular o deslocamento perpendicular

source: PERCENT
pt: POR CENTO

source: Cannot draw the shape
pt: Não é possível desenhar a forma

source: Headless graphics environment, set current DPI to 96.0
pt: Ambiente gráfico sem periféricos, defina o DPI atual para 96.0

source: The source contains no spatial info
pt: A fonte não possui nenhuma informação espacial

source: Cannot open layer : {0}
pt: Não foi possível abrir a camada : {0}

source: Cannot remove the layer {0}
pt: Não foi possível remover a camada {0}

source: Cannot close layer {0}
pt: Não foi possível fechar a camada {0}

source: Layer provided for drawing is not from the map context layer model.
pt: A camada fornecida para desenho não provém do modelo de contexto de mapa.

source: The map is not open
pt: O mapa não está aberto

source: Unable to read the provided map context
pt: Não foi possível ler o contexto de mapa fornecido

source: Error raised while exporting the map context
pt: Surgiu erro ao exportar o contexto do mapa

source: The map must be closed to invoke this method
pt: O mapa deve ser fechado para que este método seja invocado

source: Unable to parse the href URI {0}.
pt: Não foi possível analisar a URI href {0}.

source: Unable to load the description of the layer {0}
pt: Não foi possível carregar a descrição da camada {0}

source: The layer has not been imported
pt: A camada não foi importada

source: The map is already open
pt: O mapa já está aberto

source: HTTP Error {0} message : {1} with the URL {2}
pt: Erro HTTP {0} mensagem : {1} com a URL {2}

source: Invalid XML content
pt: Conteúdo XML inválido

source: Cannot parse the provided date {0}
pt: Não foi possível analisar os dados fornecidos {0}

source: HTTP Error {0} message : {1}
pt: Erro HTTP {0} mensagem : {1}

source: HTTP Error {0} message : {1} while removing the map context from {2}
pt: Erro HTTP {0} mensagem : {1} ao remover o contexto de mapa de {2}

source: HTTP Error {0} message : {1} while downloading from {2}
pt: Erro HTTP {0} mensagem : {1} ao baixar de {2}

source: Unable to load the data source uri {0}.
pt: Não foi possível carregar a uri {0} da fonte de dados.

source: Cannot move a layer to its child
pt: Não foi possível mover uma camada para seu filho

source: This layer cannot have children
pt: Esta camada não pode ter filhos

source: This layer does not have children
pt: Esta camada não possui filhos

source: This layer doesn't contain any child
pt: Esta camada não contém nenhum filho

source: No row selection in a layer collection
pt: Nenhuma linha selecionada em uma coleção de camadas
