Repository: orbisgis/orbisgis
Catalog: bundles/map-editor/src/main/resources/org/orbisgis/mapeditor/*.po
Languages: fr

source: Drawing
fr: Dessin

source: Tool error {0}
fr: Erreur d''outil {0}

source: The map editor accept only map and geometry data source.
fr: La carte n'accepte que des source de donnée de type carte ou géométrie.

source: Map
fr: Carte

source: Map Editor "{0}" [Modified]
fr: Map Editor "{0}" [Modifié]

source: The value of the scale denominator must be equal or greater than 1
fr: La valeur du dénominateur de l'échelle doit être égale ou plus grande que 1

source: Fail to load the map context, starting with an empty map context
fr: Échec de chargement du contexte cartographique, démarrage avec un contexte vide

source: MyMap.ows
fr: MaCarte.ows

source: Full extent
fr: Zoom étendu

source: Zoom to show all geometries
fr: Zoom pour voir toutes les géométries

source: Clear all selected geometries of all layers
fr: Déselectionner les géométries de toutes les couches

source: Create datasource from selection
fr: Créer une source de donnée à partir de la sélection

source: Create a datasource from the current selection
fr: Créer une source de donnée à partir de la sélection courante

source: Mesure tools
fr: Outils de mesure

source: Graphic tools
fr: Outils graphiques

source: Maps manager
fr: Gestionnaire de cartes

source: Export map as image
fr: Exporter la carte en image

source: Export image as file
fr: Exporter l'image en tant que fichier

source: Export parameters
fr: Exporter les paramètres

source: Transparent background
fr: Transparence Arrière-plan

source: Width (pixels)
fr: Largeur (pixels)

source: Height (pixels)
fr: Hauteur (pixels)

source: Keep ratio
fr: Conserver le ratio

source: Reset extent
fr: Réinitialiser l'étendue

source: Cancel
fr: Annuler

source: Save the map as image :
fr: Sauver la carte en tant qu'image :

source: No layers are selected.
fr: Aucune couche sélectionnée.

source: Layer {0} has no selected geometries.
fr: La couche {0} n'a pas de géométries sélectionnées.

source: Drawing into file
fr: Dessiner dans un fichier

source: Load the data source droped into the map editor.
fr: Chargement de la source de donnée déposée dans l'éditeur de carte.

source: Unable to create and drop the layer
fr: Impossible de créer et supprimer la couche

source: Change coordinate reference system
fr: Changer le système de coordonnée de référence

source: Scale :
fr: Échelle :

source: The format of a scale is 1:number
fr: Le format de l'échelle est 1:nombre

source: The only accepted value on nominator is 1
fr: La seule valeur de nominateur acceptée est 1

source: Select a geometry
fr: Sélectionner une géométrie

source: This tool mesure the length on the map
fr: Cet outil mesure la longueur

source: Mesure length
fr: Mesurer la longueur

source: Zoom out
fr: Dézoomer

source: This tool zoom out on click
fr: Cet outil dézoome avec un clic de la souris

source: Cannot use fence tool
fr: Impossible d'utiliser l'outil fence

source: Cannot create fence layer
fr: Impossible de créer le fence

source: Draw a fence
fr: Dessiner un fence

source: Area : {0} Perimeter : {1}
fr: Aire : {0} Périmètre : {1}

source: Mesure area
fr: Calculer l'aire

source: This tool mesure the area
fr: Cet outil calcule l'aire

source: Cannot modify the theme
fr: Impossible de modifier le thème

source: Cannot move {0}
fr: Impossible de bouger {0}

source: Pan
fr: Déplacement

source: The Pan Tool
fr: Outil de déplacement

source: Zoom in
fr: Zoomer

source: Click on the map to zoom in
fr: Cliquer sur la carte pour zoomer

source: Mesure angle
fr: Mesure d'angle

source: This tool mesure the angle
fr: Cet outil mesure l'angle

source: Polygons must have more than two points
fr: Les polygones doivent avoir plus de deux points

source: Invalid polygon
fr: Polygone invalide

source: Get feature attributes
fr: Obtenir les attributs

source: Lines must have at least two points
fr: Les lignes doivent avoir au moins deux points

source: Invalid line
fr: Ligne invalide

source: Select the first point of the zooming rectangle
fr: Sélectionnez le premier point du rectangle de zoom

source: Select the second point
fr: Sélectionner le second point

source: Select the point location
fr: Sélectionner la localisation du point

source: Select the center of the zoom
fr: Sélectionner le centre du zoom

source: Terminate polygon
fr: Terminer le polygone

source: Select the first point
fr: Sélectionner le premier point

source: Select the next point or [T]erminate polygon
fr: Sélection le point suivant ou [T]erminer le polygone

source: Cancel (transition)
fr: Annuler

source: Terminate line
fr: Terminer la ligne

source: Select the next point or terminate line
fr: Sélectionner le point suivant, ou terminer la ligne

source: Select start point
fr: Sélectionner le point de départ

source: Drag to destination point
fr: Déplacer vers le point de destination

source: Select a geometry or draw a selection rectangle
fr: Sélectionner une géométrie ou bien dessiner un rectangle de sélection

source: Click a handler to move it or select another geometry
fr: Maintenir le clic pour bouger ou bien sélectionner une autre géométrie

source: Place the handler in its new position
fr: Placer le curseur vers sa nouvelle position

source: Can't find the status of this tool.
fr: Impossible de trouver le statut de cet outil

source: Select a feature
fr: Sélectionner un objet

source: Coordinate : {0}
fr: Coordonnée : {0}

source: Pick a point
fr: Pointer un point

source: Invalid geometry. Too few vertex
fr: Géométrie invalide. Trop peu de sommet

source: The geometry is not valid
fr: La géométrie n'est pas valide

source: Cannot remove a vertex from a point geometry
fr: Impossible de supprimer un sommet à une géométrie de type point

source: Invalid MultiPoint
fr: Multi-point invalide

source: Error while drawing the feature,
fr: Erreur pendant le dessin de l'objet,

source: Error while accessing data,
fr: Erreur pendant l'accès à la donnée,

source: The current tool is not enabled
fr: L'outil courant n'est pas activé

source: Error in the tool.
fr: Erreur dans l'outil.

source: Cannot recalculate the handlers
fr: Impossible de calculer les gestionnaires

source: Invalid multipolygon
fr: Multi-polygone invalide

source: Invalid MultiLineString
fr: Multi-ligne invalide

source: Open the map context
fr: Ouvrir le contexte cartographique

source: Edit the URL
fr: Editer l'URL

source: Delete
fr: Supprimer

source: Remove this server
fr: Supprimer ce serveur

source: Update
fr: Mettre à jour

source: Download the server content
fr: Télécharger le contenu du serveur

source: Download the workspace content
fr: Télécharger le contenu de l'espace de travail

source: Enter the Map file name
fr: Entrer le nom du fichier de carte

source: MyMap
fr: MaCarte

source: The specified file name already exist
fr: Le nom de fichier spécifié existe déjà

source: The map creation has failed
fr: La création de la carte a échoué

source: New empty map
fr: Nouvelle carte vide

source: Create a new OWS Map in this folder
fr: Créer une nouvelle carte OWS dans ce dossier

source: default
fr: défaut

source: Downloading..
fr: Téléchargement ...

source: Error while downloading the map content
fr: Erreur lors du téléchargement du contexte cartographique

source: Select a folder to link with map manager
fr: Sélectionner un dossier à lier avec le gestionnaire de carte

source: Add Map Catalog folder
fr: Ajouter un dossier de catalogue de carte

source: Add link to a local folder
fr: Ajouter un lien vers le dossier local

source: Unlink
fr: Détacher

source: Unlink the folder, without deleting it
fr: Détacher le dossier, sans le supprimer

source: Open the map
fr: Ouvrir la carte

source: Are you sure you want to replace the remote map context ?
fr: Êtes-vous sûr de vouloir remplacer le contexte cartographique distant ?

source: Overwrite map context confirmation
fr: Confirmation de réécriture du contexte cartographique

source: Remove this map on the server
fr: Supprimer cette carte du serveur

source: The map cannot be removed
fr: La carte ne peut pas être supprimé

source: Delete the remote map context
fr: Supprimer le contexte cartographique distant

source: Download the workspaces of {0}
fr: Télécharger l''espace de travail de {0}

source: Cannot download the server's workspaces of {0}
fr: Impossible de télécharger les espaces de travail du serveur {0}

source: Parse maps title and description
fr: Analyser le titre et la description des cartes

source: Uploading the map context..
fr: Chargement du contexte cartographique ...

source: Download the context of {0}
fr: Télécharger le contexte de {0}

source: Cannot download the server's contexts of {0}
fr: Impossible de télécharger les contextes du serveur {0}

source: Map creation failed
fr: Création de la carte échouée

source: Are you sure you want to delete permanently the selected files ?
fr: Êtes-vous sûr de vouloir supprimer définitivement les fichiers sélectionnés ?

source: Remove the files
fr: Supprimer les fichiers

source: Cannot remove the file
fr: Impossible de supprimer le fichier

source: Cannot remove the file {0}
fr: Impossible de supprimer le fichier {0}

source: Remove permanently the map
fr: Supprimer définitivement la carte

source: Remote
fr: Distant

source: Cannot load map catalog server {0}
fr: Impossible de charger le serveur de catalogue de carte {0}

source: Enter the server URL
fr: Entrer l'URL du serveur

source: You type an incorrect URL {0}
fr: Vous entrez une URL incorrecte {0}

source: Add Map Catalog server
fr: Ajouter un serveur de catalogue de carte

source: Add a new remote map catalog
fr: Ajouter un nouveau catalogue de carte distant
