Repository: orbisgis/orbisgis
Catalog: orbisgis-sif/src/main/resources/org/orbisgis/sif/translation/language/*.po
Languages: fr

source: Search replace
fr: Chercher et remplacer

source: Text not found !
fr: Texte non trouvé !

source: &Find
fr: &Chercher

source: &Replace
fr: &Remplacer

source: Replace &All
fr: Remplacer &tout

source: &Close
fr: &Fermer

source: &Match Case
fr: &Même casse

source: &Whole Words
fr: Mots &entier

source: Regular E&xpressions
fr: E&xpressions régulière

source: M&ark all
fr: M&arquer tout

source: Search &up
fr: Chercher en &haut

source: Search &down
fr: Chercher en &bas

source: Find what:
fr: Chercher :

source: Replace with:
fr: Remplacer par:

source: Rename
fr: Renommer

source: Cannot list the directory content
fr: Impossible de lister le contenu du dossier

source: Are you sure you want to delete permanently the selected files ?
fr: Êtes-vous sûr de vouloir supprimer définitivement les fichiers sélectionnés ?

source: Remove the files
fr: Supprimer les fichiers

source: Cannot remove the folder {0}
fr: Impossible de supprimer le dossier {0}

source: The path {0} has been copied to the clipboard
fr: Le chemin {0} a été copié dans le presse-papier

source: Could not copy the folder path to the clipboard
fr: Impossible de copier le dossier dans le presse-papier

source: Copy the path
fr: Copier le chemin

source: Copy the folder path in the clipboard
fr: Copier le chemin du dossier dans le presse-papier

source: Update
fr: Mettre à jour

source: Update the content of this folder from the file system
fr: Rafraîchir le contenu de ce dossier

source: New folder
fr: Nouveau dossier

source: Create a sub-folder
fr: Créer un sous-dossier

source: Delete
fr: Supprimer

source: Remove permanently the folder
fr: Supprimer définitivement le dossier

source: Enter the folder name
fr: Entrer le nom du dossier

source: Folder
fr: Dossier

source: The folder creation has failed
fr: La création du dossier à échoué

source: Destination file {0} already exists, cannot move {1}
fr: Le fichier de destination {0} existe déjà, impossible de bouger {1}

source: Drop the content in the folder..
fr: Déposer le contenu dans le dossier ...

source: The provided filter factory name has not been registered
fr: Le filtre n'a pas été enregistré

source: Delete this filter
fr: Supprimer ce filtre

source: Add a new filter
fr: Ajouter un nouveau filtre

source: Cancel
fr: Annuler

source: Error while drop Editable
fr: Erreur pendant le "glisser/déposer" du document

source: Problem when checking for an unbroken range of comments
fr: Erreur lors de la vérification de l'état d'un bloc de lignes mis en commentaire

source: Assuming the selection is not already block commented.
fr: La sélection n'est pas déjà commentée.

source: Invalid length or offset when trying to uncomment code.
fr: Erreur lors de la tentative de mise en commentaire
